// Auto-generated data
export const allStudents = [{"id":1,"name":"منة محمود عويس محمود","sheet":"فاطمة محمد صادق","total":244.5,"percentage":0.978},{"id":6,"name":"سلمى عصام عبدالعظيم معوض","sheet":"نورهان محمد شحاتة","total":244.25,"percentage":0.977},{"id":1,"name":"مريم محمد محمود موسى","sheet":"أسماء عبدالموجود صالح","total":244,"percentage":0.976},{"id":1,"name":"حمزة حسين فضالي عويس","sheet":"أسماء جابر محمد","total":242.25,"percentage":0.969},{"id":2,"name":"جنا رجب فتحي سيد","sheet":"فاطمة محمد صادق","total":242,"percentage":0.968},{"id":3,"name":"منة الله إمام محمد إمام","sheet":"فاطمة محمد صادق","total":241.5,"percentage":0.966},{"id":1,"name":"حنين محمود سالم عبدالعليم","sheet":"أسماء شريف عبدالعظم","total":241.5,"percentage":0.966},{"id":1,"name":"يارا أحمد جابر شاكر","sheet":"حبيبة أحمد حفني","total":241,"percentage":0.964},{"id":5,"name":"جنا شريف شحاتة علي","sheet":"غادة ربيع عبدالعال","total":241,"percentage":0.964},{"id":1,"name":"نورهان محمود عويس محمود","sheet":"إسراء أحمد حمدان","total":240.5,"percentage":0.962},{"id":1,"name":"شهد سيد رضوان عبد الحميد","sheet":"زينب محمد العريان","total":240.25,"percentage":0.961},{"id":2,"name":"رودينا محمد محمود سيد","sheet":"زينب محمد العريان","total":240,"percentage":0.96},{"id":1,"name":"يوسف محمود خليل إبراهيم","sheet":"بسمة شحاتة شعبان","total":240,"percentage":0.96},{"id":1,"name":"محمد أحمد رمضان عبدالتواب","sheet":"حجاج محمد عبدالتواب","total":239.75,"percentage":0.959},{"id":1,"name":"حبيبة سيد محمود محمد","sheet":"حبيبة ربيع مفتاح","total":239.75,"percentage":0.959},{"id":2,"name":"رودينا محمود صلاح عيسى","sheet":"أسماء جابر محمد","total":239.5,"percentage":0.958},{"id":2,"name":"رحيق علي سليمان علي","sheet":"بسمة شحاتة شعبان","total":239.25,"percentage":0.957},{"id":2,"name":"محمد محمود سيد حسين","sheet":"أسماء عبدالموجود صالح","total":239,"percentage":0.956},{"id":1,"name":"خديجة عبدالناصر عبدالله أحمد","sheet":"مروة حسن قرني","total":238.75,"percentage":0.955},{"id":3,"name":"أحمد محمد حمدي محمد","sheet":"بسمة شحاتة شعبان","total":238.5,"percentage":0.954},{"id":1,"name":"خديجة أحمد علي قرني","sheet":"منة أحمد خليل","total":238.5,"percentage":0.954},{"id":3,"name":"حنين سيد عويس قطب","sheet":"أسماء جابر محمد","total":238.25,"percentage":0.953},{"id":1,"name":"أسماء محمد محمد أحمد","sheet":"فوزية أشرف عوض","total":238,"percentage":0.952},{"id":1,"name":"رحمة عصام عبدالعظيم معوض","sheet":"فاطمة قرني سيد","total":238,"percentage":0.952},{"id":2,"name":"ساجد محمد رمضان محمود","sheet":"حبيبة أحمد حفني","total":238,"percentage":0.952},{"id":3,"name":"جودي عماد عمر عبدالمنعم","sheet":"أسماء عبدالموجود صالح","total":238,"percentage":0.952},{"id":4,"name":"دينا أحمد جلال عبدالجواد","sheet":"أسماء عبدالموجود صالح","total":238,"percentage":0.952},{"id":4,"name":"يارا خالد إسماعيل حسن","sheet":"بسمة شحاتة شعبان","total":237.75,"percentage":0.951},{"id":2,"name":"فاطمة أحمد فتحي محمد","sheet":"إسراء أحمد حمدان","total":237.5,"percentage":0.95},{"id":5,"name":"ريم وليد سيد خالد","sheet":"بسمة شحاتة شعبان","total":237.5,"percentage":0.95},{"id":4,"name":"فاطمة شريف حسين علي","sheet":"أسماء جابر محمد","total":237.5,"percentage":0.95},{"id":3,"name":"أنس شوقي أحمد محمد","sheet":"حبيبة أحمد حفني","total":237.5,"percentage":0.95},{"id":4,"name":"كنوز علي شحاتة حسن","sheet":"حبيبة أحمد حفني","total":237.5,"percentage":0.95},{"id":2,"name":"حنين عاطف أحمد علي","sheet":"حبيبة ربيع مفتاح","total":237.25,"percentage":0.949},{"id":2,"name":"منة حسين فضالي عويس","sheet":"فاطمة قرني سيد","total":237,"percentage":0.948},{"id":5,"name":"مكة علي سيد عطية","sheet":"حبيبة أحمد حفني","total":237,"percentage":0.948},{"id":6,"name":"ملك أحمد عويس عبدالله","sheet":"حبيبة أحمد حفني","total":237,"percentage":0.948},{"id":4,"name":"رحيق محمد شحاتة متولي","sheet":"فاطمة محمد صادق","total":236.75,"percentage":0.947},{"id":3,"name":"عبدالرحمن شعبان عويس عبدالله","sheet":"حبيبة ربيع مفتاح","total":236.75,"percentage":0.947},{"id":5,"name":"رقية مؤمن يحى محمود","sheet":"أسماء عبدالموجود صالح","total":236.75,"percentage":0.947},{"id":1,"name":"نجلاء عبدالفتاح علي عبدالماجد","sheet":"آلاء جمال رمضان","total":236.5,"percentage":0.946},{"id":5,"name":"سنة الله محمد سيد عطية","sheet":"فاطمة محمد صادق","total":236,"percentage":0.944},{"id":6,"name":"هاجر أحمد قرني محمد","sheet":"فاطمة محمد صادق","total":236,"percentage":0.944},{"id":2,"name":"إلهام محمد محمود جاد","sheet":"فوزية أشرف عوض","total":236,"percentage":0.944},{"id":3,"name":"منال شوقي أحمد إسماعيل","sheet":"فوزية أشرف عوض","total":236,"percentage":0.944},{"id":6,"name":"محمد أحمد قرني سليمان","sheet":"أسماء عبدالموجود صالح","total":236,"percentage":0.944},{"id":3,"name":"ياسمين صادق سيد صادق","sheet":"زينب محمد العريان","total":235.75,"percentage":0.943},{"id":12,"name":"عبدالرحمن محمود سيد حسين","sheet":"غادة ربيع عبدالعال","total":235.5,"percentage":0.942},{"id":7,"name":"رحمة محمد عرفات سيد","sheet":"فاطمة محمد صادق","total":235.25,"percentage":0.941},{"id":1,"name":"مايا هاني أحمد إمام","sheet":"صفاء رمضان عبدالوهاب","total":235,"percentage":0.94},{"id":3,"name":"رحمة إسماعيل حجاج إسماعيل","sheet":"إسراء أحمد حمدان","total":235,"percentage":0.94},{"id":2,"name":"نجلاء جابر صادق محمد","sheet":"آلاء جمال رمضان","total":235,"percentage":0.94},{"id":7,"name":"رقية مفتاح سيد عبدالحميد","sheet":"حبيبة أحمد حفني","total":235,"percentage":0.94},{"id":1,"name":"حور محمود علي عبدالعزيز","sheet":"علياء رجب محمد","total":235,"percentage":0.94},{"id":8,"name":"هنا محمود حمدي أحمد","sheet":"فاطمة محمد صادق","total":234.5,"percentage":0.938},{"id":9,"name":"منى رجب محمد محمد","sheet":"نورهان محمد شحاتة","total":234.5,"percentage":0.938},{"id":4,"name":"نورة سيد حفني حسن","sheet":"فوزية أشرف عوض","total":234.5,"percentage":0.938},{"id":1,"name":"مصطفى عبدالسلام سيد عبدالعليم","sheet":"عبدالرحمن محمد حسن","total":234,"percentage":0.936},{"id":2,"name":"ملك أكرم شعبان سيد","sheet":"أسماء شريف عبدالعظم","total":234,"percentage":0.936},{"id":8,"name":"علياء إيهاب سيد عبدالعظيم","sheet":"حبيبة أحمد حفني","total":234,"percentage":0.936},{"id":7,"name":"أميره أحمد عبدالله عبدالنبي","sheet":"أسماء عبدالموجود صالح","total":234,"percentage":0.936},{"id":2,"name":"حياة حجازي سيد ياسين","sheet":"علياء رجب محمد","total":234,"percentage":0.936},{"id":3,"name":"جنا رمضان سيد قرني","sheet":"أسماء شريف عبدالعظم","total":233.75,"percentage":0.935},{"id":2,"name":"عبدالرحمن سيد قرني سليمان","sheet":"حجاج محمد عبدالتواب","total":233.5,"percentage":0.934},{"id":9,"name":"حمزة محمد زكريا سليمان","sheet":"فاطمة محمد صادق","total":233.5,"percentage":0.934},{"id":4,"name":"ايمان شعبان احمد محمد","sheet":"زينب محمد العريان","total":233.5,"percentage":0.934},{"id":3,"name":"نعمة فضالي عويس عثمان","sheet":"آلاء جمال رمضان","total":233.5,"percentage":0.934},{"id":3,"name":"حبيبة أحمد سيد حفني","sheet":"فاطمة قرني سيد","total":233.5,"percentage":0.934},{"id":2,"name":"حفصة عبدالرحمن فؤاد سلطان","sheet":"منة أحمد خليل","total":233.5,"percentage":0.934},{"id":7,"name":"رحمة أحمد سيد خميس","sheet":"شروق ياسر يوسف","total":233.25,"percentage":0.933},{"id":6,"name":"جيداء حمادة سلامة سيد","sheet":"بسمة شحاتة شعبان","total":233.25,"percentage":0.933},{"id":7,"name":"ريتال أحمد رمضان صديق","sheet":"بسمة شحاتة شعبان","total":233.25,"percentage":0.933},{"id":2,"name":"حبيبة علي سليمان علي","sheet":"مروة حسن قرني","total":233,"percentage":0.932},{"id":4,"name":"مى أحمد فتحي محمد","sheet":"حبيبة ربيع مفتاح","total":233,"percentage":0.932},{"id":10,"name":"رأفت أحمد رشاد حسن","sheet":"فاطمة محمد صادق","total":232.5,"percentage":0.93},{"id":5,"name":"هدير علي شحاتة حسن","sheet":"حبيبة ربيع مفتاح","total":232.5,"percentage":0.93},{"id":1,"name":"عدى جمعة فتح الباب محمد","sheet":"دينا مصطفى كامل","total":232.5,"percentage":0.93},{"id":9,"name":"محمد أحمد عويس عبدالله","sheet":"حبيبة أحمد حفني","total":232.5,"percentage":0.93},{"id":3,"name":"زياد عبدالنبي شعبان شحاتة","sheet":"منة أحمد خليل","total":232.5,"percentage":0.93},{"id":5,"name":"حنين شامل مصطفى سيد","sheet":"نورهان محمد شحاتة","total":232,"percentage":0.928},{"id":6,"name":"إسراء محمود عبدالفضيل عبدالحميد","sheet":"حبيبة ربيع مفتاح","total":232,"percentage":0.928},{"id":4,"name":"ريتاج عصام عبدالحميد جابر","sheet":"إسراء أحمد حمدان","total":232,"percentage":0.928},{"id":5,"name":"أمل على","sheet":"فوزية أشرف عوض","total":232,"percentage":0.928},{"id":8,"name":"ريتاج ربيع أحمد عبدالعليم","sheet":"أسماء عبدالموجود صالح","total":232,"percentage":0.928},{"id":3,"name":"فرحة محمود سيد  ياسين","sheet":"علياء رجب محمد","total":232,"percentage":0.928},{"id":1,"name":"أنس حسين عبدالواحد محمد","sheet":"إيمان حمادة شحاتة","total":232,"percentage":0.928},{"id":7,"name":"زياد أحمد عطية محمد","sheet":"غادة ربيع عبدالعال","total":232,"percentage":0.928},{"id":5,"name":"فاطمة الزهراء محمود زكريا سليمان","sheet":"أسماء جابر محمد","total":231.75,"percentage":0.927},{"id":11,"name":"ياسين محمد زكريا سليمان","sheet":"فاطمة محمد صادق","total":231.5,"percentage":0.926},{"id":1,"name":"مروه محمد رجب كامل","sheet":"آية شريف عبدالعظيم رمزي","total":231.5,"percentage":0.926},{"id":6,"name":"ملك إسلام محمود جابر","sheet":"أسماء جابر محمد","total":231.5,"percentage":0.926},{"id":4,"name":"ملك سلامة عبدالوهاب عبدالحميد","sheet":"فاطمة قرني سيد","total":231.5,"percentage":0.926},{"id":10,"name":"علي محمد سيد عطية","sheet":"حبيبة أحمد حفني","total":231.5,"percentage":0.926},{"id":8,"name":"جنا شعبان إسماعيل سيد","sheet":"بسمة شحاتة شعبان","total":231.25,"percentage":0.925},{"id":9,"name":"زياد محمود عبدالفتاح عبدالعزيز","sheet":"بسمة شحاتة شعبان","total":231.25,"percentage":0.925},{"id":5,"name":"إيمان شوقي أحمد محمد","sheet":"فاطمة قرني سيد","total":231.25,"percentage":0.925},{"id":2,"name":"جنى محمد خميس عبد العظيم","sheet":"آية شريف عبدالعظيم رمزي","total":231,"percentage":0.924},{"id":2,"name":"مريم سيد سعيد احمد","sheet":"دينا مصطفى كامل","total":231,"percentage":0.924},{"id":4,"name":"أبرار محمود سيد ياسين","sheet":"علياء رجب محمد","total":231,"percentage":0.924},{"id":4,"name":"أشرقت أحمد رشاد حسن","sheet":"منة أحمد خليل","total":231,"percentage":0.924},{"id":9,"name":"شهد محمد غانم محمد","sheet":"غادة ربيع عبدالعال","total":231,"percentage":0.924},{"id":12,"name":"ملك أحمد عبدالله عبدالنبي","sheet":"فاطمة محمد صادق","total":230.5,"percentage":0.922},{"id":11,"name":"أنس أحمد عبدالفتاح محمد","sheet":"حبيبة أحمد حفني","total":230.5,"percentage":0.922},{"id":5,"name":"جودي محمد صالح خالد","sheet":"منة أحمد خليل","total":230.5,"percentage":0.922},{"id":4,"name":"باسل أحمد محمد عبدالعزيز","sheet":"غادة ربيع عبدالعال","total":230.5,"percentage":0.922},{"id":18,"name":"مريم عبدالعال محمد عبداللطيف","sheet":"غادة ربيع عبدالعال","total":230.5,"percentage":0.922},{"id":3,"name":"عمار حسين فضالى عويس","sheet":"آية شريف عبدالعظيم رمزي","total":230.25,"percentage":0.921},{"id":2,"name":"معاذ علي سليمان علي","sheet":"عبدالرحمن محمد حسن","total":230,"percentage":0.92},{"id":13,"name":"أبرار سلامة إبراهيم أمين","sheet":"فاطمة محمد صادق","total":230,"percentage":0.92},{"id":5,"name":"مازن كامل رجب جابر","sheet":"إسراء أحمد حمدان","total":230,"percentage":0.92},{"id":7,"name":"علي محمود عبدالفضيل عبدالمجيد","sheet":"أسماء جابر محمد","total":230,"percentage":0.92},{"id":12,"name":"كرمة حمادة فتحي أبوالنجا","sheet":"حبيبة أحمد حفني","total":230,"percentage":0.92},{"id":9,"name":"ماهر أحمد عبدالعزيز روبي","sheet":"أسماء عبدالموجود صالح","total":230,"percentage":0.92},{"id":10,"name":"محمد أحمد عبدالله عبدالنبي","sheet":"أسماء عبدالموجود صالح","total":230,"percentage":0.92},{"id":5,"name":"معاذ حسن فتحي أحمد","sheet":"علياء رجب محمد","total":230,"percentage":0.92},{"id":6,"name":"سيف محمد فتحي موسى","sheet":"منة أحمد خليل","total":230,"percentage":0.92},{"id":5,"name":"رضا عرفة عطية ميزار","sheet":"زينب محمد العريان","total":229.5,"percentage":0.918},{"id":7,"name":"أسيل عصام عبدالحميد صابر","sheet":"حبيبة ربيع مفتاح","total":229.5,"percentage":0.918},{"id":6,"name":"حمزة عمر حسين سليمان","sheet":"إسراء أحمد حمدان","total":229.5,"percentage":0.918},{"id":6,"name":"فاطمة شوقي أحمد محمد","sheet":"فاطمة قرني سيد","total":229.5,"percentage":0.918},{"id":11,"name":"حفصة أحمد حامد شحاتة","sheet":"أسماء عبدالموجود صالح","total":229.5,"percentage":0.918},{"id":12,"name":"محمد رجب عثمان قطب","sheet":"أسماء عبدالموجود صالح","total":229.5,"percentage":0.918},{"id":6,"name":"مريم عادل إمام عبدالرحمن","sheet":"علياء رجب محمد","total":229.5,"percentage":0.918},{"id":4,"name":"جودي محمود محمد","sheet":"أسماء شريف عبدالعظم","total":229,"percentage":0.916},{"id":7,"name":"أحمد رمضان سيد قرنى","sheet":"إسراء أحمد حمدان","total":229,"percentage":0.916},{"id":8,"name":"ضحى مصطفى سعدالدين","sheet":"إسراء أحمد حمدان","total":229,"percentage":0.916},{"id":4,"name":"آية أحمد محمود عوض الله","sheet":"آلاء جمال رمضان","total":229,"percentage":0.916},{"id":13,"name":"محمد علي سيد عطية","sheet":"حبيبة أحمد حفني","total":229,"percentage":0.916},{"id":13,"name":"شمس محمد حسني حامد","sheet":"أسماء عبدالموجود صالح","total":229,"percentage":0.916},{"id":7,"name":"سندس أحمد سيد عطية","sheet":"علياء رجب محمد","total":229,"percentage":0.916},{"id":1,"name":"عائشة محمود سيد حسين","sheet":"شاهندة حمادة عبدالفتاح","total":229,"percentage":0.916},{"id":8,"name":"يمنى حامد عبدالنبي داود","sheet":"أسماء جابر محمد","total":228.75,"percentage":0.915},{"id":14,"name":"أحمد شعبان أحمد محمد","sheet":"فاطمة محمد صادق","total":228.5,"percentage":0.914},{"id":15,"name":"حبيبة محمد عرفات سيد علي","sheet":"فاطمة محمد صادق","total":228.5,"percentage":0.914},{"id":9,"name":"ريتاج محمد عزت محمد","sheet":"شروق ياسر يوسف","total":228.5,"percentage":0.914},{"id":5,"name":"إيمان محمد محمد أحمد","sheet":"آلاء جمال رمضان","total":228.5,"percentage":0.914},{"id":14,"name":"ملك أحمد عبدالفتاح محمد","sheet":"حبيبة أحمد حفني","total":228.5,"percentage":0.914},{"id":5,"name":"منة محمد سيد عويس","sheet":"أسماء شريف عبدالعظم","total":228,"percentage":0.912},{"id":2,"name":"حمزة أحمد حمدي طه","sheet":"صفاء رمضان عبدالوهاب","total":228,"percentage":0.912},{"id":8,"name":"ليليان محمود محمد عطية","sheet":"حبيبة ربيع مفتاح","total":228,"percentage":0.912},{"id":6,"name":"ناهد عبدالستار حامد سيد","sheet":"فوزية أشرف عوض","total":228,"percentage":0.912},{"id":9,"name":"ملك محمد علي حسين","sheet":"أسماء جابر محمد","total":228,"percentage":0.912},{"id":10,"name":"جنة أحمد عبدالمنعم صادق","sheet":"أسماء جابر محمد","total":228,"percentage":0.912},{"id":11,"name":"ندى محمد زكريا سليمان","sheet":"أسماء جابر محمد","total":228,"percentage":0.912},{"id":3,"name":"خديجة محمود اسماعيل حامد","sheet":"دينا مصطفى كامل","total":228,"percentage":0.912},{"id":14,"name":"ياسمين محمود سالم عبدالعليم","sheet":"أسماء عبدالموجود صالح","total":228,"percentage":0.912},{"id":8,"name":"جنة رجب حجازي عبدالحميد","sheet":"علياء رجب محمد","total":228,"percentage":0.912},{"id":1,"name":"ياسين إسماعيل حجاج إسماعيل","sheet":"منى علاء جمعة","total":228,"percentage":0.912},{"id":7,"name":"عدي محسن مختار كامل","sheet":"منة أحمد خليل","total":228,"percentage":0.912},{"id":8,"name":"سيف سيد مغازي عبدالجواد","sheet":"غادة ربيع عبدالعال","total":228,"percentage":0.912},{"id":16,"name":"جنا محمود حمدي أحمد","sheet":"فاطمة محمد صادق","total":227.75,"percentage":0.911},{"id":9,"name":"حنين أحمد رمضان شعبان","sheet":"حبيبة ربيع مفتاح","total":227.5,"percentage":0.91},{"id":7,"name":"رزقة علي عبدالجليل أسعد","sheet":"فوزية أشرف عوض","total":227.5,"percentage":0.91},{"id":6,"name":"إيمان صلاح عيسى عبدالجواد","sheet":"آلاء جمال رمضان","total":227.5,"percentage":0.91},{"id":7,"name":"سحر محمد عويس مصطفى","sheet":"آلاء جمال رمضان","total":227.5,"percentage":0.91},{"id":4,"name":"مهران محمد رأفت عبدالحكم","sheet":"دينا مصطفى كامل","total":227.5,"percentage":0.91},{"id":15,"name":"صفاء أحمد حامد شحاتة","sheet":"أسماء عبدالموجود صالح","total":227.5,"percentage":0.91},{"id":16,"name":"مصطفى محمود صلاح عيسى","sheet":"أسماء عبدالموجود صالح","total":227.5,"percentage":0.91},{"id":9,"name":"حور علاء إمام عبدالرحمن","sheet":"علياء رجب محمد","total":227.5,"percentage":0.91},{"id":2,"name":"حمزة أحمد سعد محمد","sheet":"شاهندة حمادة عبدالفتاح","total":227.5,"percentage":0.91},{"id":20,"name":"يحيى كمال جابر عبدالعزيز","sheet":"غادة ربيع عبدالعال","total":227.5,"percentage":0.91},{"id":17,"name":"سما محمد سعد محمد","sheet":"فاطمة محمد صادق","total":227.25,"percentage":0.909},{"id":10,"name":"سمر شريف حسين علي","sheet":"حبيبة ربيع مفتاح","total":227.25,"percentage":0.909},{"id":1,"name":"ملك حسني أحمد حامد","sheet":"رقية نصار عبدالمعتمد","total":227.25,"percentage":0.909},{"id":12,"name":"حبيبة محمود عبدالفضيل عبدالحميد","sheet":"أسماء جابر محمد","total":227.25,"percentage":0.909},{"id":3,"name":"محمود ربيع أحمد عبدالعليم","sheet":"حجاج محمد عبدالتواب","total":227,"percentage":0.908},{"id":3,"name":"أحمد محمد حسين سلامة","sheet":"عبدالرحمن محمد حسن","total":227,"percentage":0.908},{"id":4,"name":"سارة محمد سيد ياسين","sheet":"نادية سيد سلامة","total":227,"percentage":0.908},{"id":8,"name":"أطاطة صلاح محمود عبدالجواد","sheet":"فوزية أشرف عوض","total":227,"percentage":0.908},{"id":8,"name":"حبوبة حمدي إدريس علي","sheet":"آلاء جمال رمضان","total":227,"percentage":0.908},{"id":1,"name":"رحمة عبدالرحمن عواد إبراهيم","sheet":"منة محمد عبدالعظيم","total":227,"percentage":0.908},{"id":15,"name":"الحسين أيمن عبدالفتاح أحمد","sheet":"حبيبة أحمد حفني","total":227,"percentage":0.908},{"id":10,"name":"أسمهان حمادة عبدالفتاح حامد","sheet":"علياء رجب محمد","total":227,"percentage":0.908},{"id":11,"name":"بسنت عبدالسلام عبدالعزيز إمام","sheet":"علياء رجب محمد","total":227,"percentage":0.908},{"id":12,"name":"بشرى حسين ربيع حسين","sheet":"علياء رجب محمد","total":227,"percentage":0.908},{"id":2,"name":"ياسين أحمد رجب عويس","sheet":"منى علاء جمعة","total":227,"percentage":0.908},{"id":3,"name":"آية سامح حامد محمد","sheet":"غادة ربيع عبدالعال","total":227,"percentage":0.908},{"id":6,"name":"جنى حامد ربيع حامد","sheet":"غادة ربيع عبدالعال","total":227,"percentage":0.908},{"id":4,"name":"جنى سلامه صبرى شحاته","sheet":"نورهان محمد شحاتة","total":226.5,"percentage":0.906},{"id":6,"name":"بسملة وليد عبدالفتاح عبدالحميد","sheet":"زينب محمد العريان","total":226.5,"percentage":0.906},{"id":7,"name":"عزه محمد حامد بيومى","sheet":"زينب محمد العريان","total":226.5,"percentage":0.906},{"id":7,"name":"رنا علاء محمد قرني","sheet":"فاطمة قرني سيد","total":226.5,"percentage":0.906},{"id":5,"name":"نادين طه محمد صادق","sheet":"دينا مصطفى كامل","total":226.5,"percentage":0.906},{"id":17,"name":"روفيدة وليد سيد خالد","sheet":"أسماء عبدالموجود صالح","total":226.5,"percentage":0.906},{"id":2,"name":"سجدة أحمد عطية محمد","sheet":"إيمان حمادة شحاتة","total":226.5,"percentage":0.906},{"id":1,"name":"أنس سامح حامد محمد","sheet":"غادة ربيع عبدالعال","total":226.5,"percentage":0.906},{"id":11,"name":"رضوى أكرم شعبان سيد","sheet":"حبيبة ربيع مفتاح","total":226.25,"percentage":0.905},{"id":10,"name":"حبيبة أحمد فتحي محمد","sheet":"بسمة شحاتة شعبان","total":226.25,"percentage":0.905},{"id":13,"name":"رودينا أحمد يوسف إبراهيم","sheet":"أسماء جابر محمد","total":226.25,"percentage":0.905},{"id":2,"name":"رودينا ربيع عطية عوض","sheet":"منة محمد عبدالعظيم","total":226,"percentage":0.904},{"id":3,"name":"سليم صبرى جابر علاء الدين","sheet":"شاهندة حمادة عبدالفتاح","total":226,"percentage":0.904},{"id":3,"name":"أنس محمد عبدالفتاح جابر","sheet":"منى علاء جمعة","total":226,"percentage":0.904},{"id":14,"name":"فيروز إيهاب محمد عبدالرحمن","sheet":"أسماء جابر محمد","total":225.75,"percentage":0.903},{"id":3,"name":"ألاء محمد عويس جنيدي","sheet":"صفاء رمضان عبدالوهاب","total":225.5,"percentage":0.902},{"id":4,"name":"سما محمد حسن علي","sheet":"صفاء رمضان عبدالوهاب","total":225.5,"percentage":0.902},{"id":15,"name":"أنس محمود إسماعيل حامد","sheet":"أسماء جابر محمد","total":225.5,"percentage":0.902},{"id":18,"name":"إياد محمد حسني حامد","sheet":"أسماء عبدالموجود صالح","total":225.5,"percentage":0.902},{"id":19,"name":"شمس علي عويس محمود","sheet":"أسماء عبدالموجود صالح","total":225.5,"percentage":0.902},{"id":13,"name":"مكة أحمد محمد إسماعيل","sheet":"علياء رجب محمد","total":225.5,"percentage":0.902},{"id":3,"name":"سجدة مصطفى سيد عبدالعظيم","sheet":"إيمان حمادة شحاتة","total":225.5,"percentage":0.902},{"id":6,"name":"عبدالله فارس سمير موسى","sheet":"أسماء شريف عبدالعظم","total":225,"percentage":0.9},{"id":12,"name":"سما سلامة عبدالفتاح","sheet":"إسراء أحمد حمدان","total":225,"percentage":0.9},{"id":16,"name":"أبرار عماد رمضان عبدالله","sheet":"أسماء جابر محمد","total":225,"percentage":0.9},{"id":4,"name":"مكة محمود عيد متولي","sheet":"شاهندة حمادة عبدالفتاح","total":225,"percentage":0.9},{"id":4,"name":"أحمد نبيل فتحي عبدالسلام","sheet":"عبدالرحمن محمد حسن","total":224.75,"percentage":0.899},{"id":17,"name":"ريماس محمد عبدالعزيز صادق","sheet":"أسماء جابر محمد","total":224.75,"percentage":0.899},{"id":4,"name":"حامد سيد حامد سيد","sheet":"حجاج محمد عبدالتواب","total":224.5,"percentage":0.898},{"id":7,"name":"هاجر أدهم محمد إبراهيم","sheet":"أسماء شريف عبدالعظم","total":224.5,"percentage":0.898},{"id":5,"name":"ألاء حسين عبدالواحد محمد","sheet":"صفاء رمضان عبدالوهاب","total":224.5,"percentage":0.898},{"id":14,"name":"روضة أحمد حسن محمد","sheet":"علياء رجب محمد","total":224.5,"percentage":0.898},{"id":18,"name":"رويدا رجب فتحي سيد","sheet":"فاطمة محمد صادق","total":224,"percentage":0.896},{"id":6,"name":"عبدالرحمن ياسين سيد ياسين","sheet":"صفاء رمضان عبدالوهاب","total":224,"percentage":0.896},{"id":11,"name":"رنا صادق جابر صادق","sheet":"بسمة شحاتة شعبان","total":224,"percentage":0.896},{"id":3,"name":"أنس محمد شوقي عبدالجواد","sheet":"منة محمد عبدالعظيم","total":224,"percentage":0.896},{"id":16,"name":"الحسن أيمن عبدالفتاح أحمد","sheet":"حبيبة أحمد حفني","total":224,"percentage":0.896},{"id":17,"name":"حنين إبراهيم عبداللطيف إسماعيل","sheet":"حبيبة أحمد حفني","total":224,"percentage":0.896},{"id":15,"name":"منسة شحاتة أحمد نوح","sheet":"علياء رجب محمد","total":224,"percentage":0.896},{"id":5,"name":"فريدة محمود إسماعيل سيد","sheet":"شاهندة حمادة عبدالفتاح","total":224,"percentage":0.896},{"id":8,"name":"رضا عزت شحاتة علي","sheet":"منة أحمد خليل","total":224,"percentage":0.896},{"id":15,"name":"محمد أكرم إسماعيل سيد","sheet":"غادة ربيع عبدالعال","total":224,"percentage":0.896},{"id":5,"name":"مصطفى وائل أحمد علي","sheet":"عبدالرحمن محمد حسن","total":223.5,"percentage":0.894},{"id":6,"name":"يوسف محمد يحيي محمود","sheet":"عبدالرحمن محمد حسن","total":223.5,"percentage":0.894},{"id":7,"name":"محمد فتحي جابر إمام","sheet":"صفاء رمضان عبدالوهاب","total":223.5,"percentage":0.894},{"id":9,"name":"شهاب أشرف خميس عبدالجواد","sheet":"إسراء أحمد حمدان","total":223.5,"percentage":0.894},{"id":10,"name":"عبدالله مصطفى سعد علي","sheet":"إسراء أحمد حمدان","total":223.5,"percentage":0.894},{"id":18,"name":"رقية أحمد عويس عبدالله","sheet":"أسماء جابر محمد","total":223.5,"percentage":0.894},{"id":8,"name":"اسراء احمد خليل ابراهيم","sheet":"صفاء رمضان عبدالوهاب","total":223,"percentage":0.892},{"id":4,"name":"حمزه محمود عبد الحليم محمد","sheet":"آية شريف عبدالعظيم رمزي","total":223,"percentage":0.892},{"id":5,"name":"عمر أحمد تهامى على","sheet":"آية شريف عبدالعظيم رمزي","total":223,"percentage":0.892},{"id":12,"name":"رودينا محمود مصطفى حسين","sheet":"بسمة شحاتة شعبان","total":223,"percentage":0.892},{"id":9,"name":"سامية رمضان سيد سيد","sheet":"آلاء جمال رمضان","total":223,"percentage":0.892},{"id":8,"name":"سلسبيل محمد عبدالعزيز محمد","sheet":"فاطمة قرني سيد","total":223,"percentage":0.892},{"id":16,"name":"ريتياج محمد عبدالله عبدالعظيم","sheet":"علياء رجب محمد","total":223,"percentage":0.892},{"id":6,"name":"بتول أحمد سعد محمد","sheet":"شاهندة حمادة عبدالفتاح","total":223,"percentage":0.892},{"id":7,"name":"مكة أشرف سليمان عبدالمنعم","sheet":"شاهندة حمادة عبدالفتاح","total":223,"percentage":0.892},{"id":9,"name":"محمد حمادة شحاتة عبدالجواد","sheet":"منة أحمد خليل","total":223,"percentage":0.892},{"id":10,"name":"صفا محمد حمادة عبدالله","sheet":"غادة ربيع عبدالعال","total":223,"percentage":0.892},{"id":13,"name":"رؤى أحمد رمضان صديق","sheet":"بسمة شحاتة شعبان","total":222.5,"percentage":0.89},{"id":20,"name":"رحمة محمد رمضان صديق","sheet":"أسماء عبدالموجود صالح","total":222.5,"percentage":0.89},{"id":9,"name":"مريم عبدالوهاب شعبان عبدالوهاب","sheet":"صفاء رمضان عبدالوهاب","total":222,"percentage":0.888},{"id":11,"name":"أنس محمد صلاح علي","sheet":"إسراء أحمد حمدان","total":222,"percentage":0.888},{"id":19,"name":"محمد سعيد أحمد عباس","sheet":"أسماء جابر محمد","total":222,"percentage":0.888},{"id":7,"name":"عمر وجيه برباش جابر","sheet":"شروق ياسر يوسف","total":222,"percentage":0.888},{"id":4,"name":"نهى محمد طه محمد","sheet":"منة محمد عبدالعظيم","total":222,"percentage":0.888},{"id":8,"name":"لوجي عصام عبدالحميد عمر","sheet":"شاهندة حمادة عبدالفتاح","total":222,"percentage":0.888},{"id":4,"name":"رودينا محمود فتحي أمين","sheet":"منى علاء جمعة","total":222,"percentage":0.888},{"id":5,"name":"فريدة محمود حمدي طه","sheet":"منى علاء جمعة","total":222,"percentage":0.888},{"id":6,"name":"لوجي أحمد فتحي عبدالسلام","sheet":"منى علاء جمعة","total":222,"percentage":0.888},{"id":7,"name":"معتز هاني عبدالحميد خالد","sheet":"منى علاء جمعة","total":222,"percentage":0.888},{"id":8,"name":"ياسين أحمد عويس أحمد","sheet":"منى علاء جمعة","total":222,"percentage":0.888},{"id":14,"name":"محمد أحمد محمد عبدالعزيز","sheet":"غادة ربيع عبدالعال","total":222,"percentage":0.888},{"id":5,"name":"فارس صلاح رمضان محمد","sheet":"حجاج محمد عبدالتواب","total":221.5,"percentage":0.886},{"id":3,"name":"حبيبة تامر رمضان عويس","sheet":"مروة حسن قرني","total":221.5,"percentage":0.886},{"id":14,"name":"روضة مصطفى قرني محمد","sheet":"بسمة شحاتة شعبان","total":221.5,"percentage":0.886},{"id":16,"name":"محمد سيد محمد علي","sheet":"غادة ربيع عبدالعال","total":221.5,"percentage":0.886},{"id":10,"name":"هنا سيد سعيد أحمد","sheet":"صفاء رمضان عبدالوهاب","total":221,"percentage":0.884},{"id":11,"name":"ياسين أحمد عبدالعليم سيد","sheet":"صفاء رمضان عبدالوهاب","total":221,"percentage":0.884},{"id":8,"name":"عبد الرحمن محمود حمدى طه","sheet":"زينب محمد العريان","total":221,"percentage":0.884},{"id":9,"name":"معاذ محمود حمدى طه","sheet":"زينب محمد العريان","total":221,"percentage":0.884},{"id":12,"name":"ندى محمد فضالى عويس","sheet":"غادة ربيع عبدالعال","total":221,"percentage":0.884},{"id":5,"name":"مكة وجية فتحي مغازي","sheet":"منة محمد عبدالعظيم","total":221,"percentage":0.884},{"id":6,"name":"هنا محمد عباس أحمد","sheet":"منة محمد عبدالعظيم","total":221,"percentage":0.884},{"id":17,"name":"بسملة أنور سيد أنور","sheet":"علياء رجب محمد","total":221,"percentage":0.884},{"id":9,"name":"إيلين أكرم إسماعيل سيد","sheet":"شاهندة حمادة عبدالفتاح","total":221,"percentage":0.884},{"id":10,"name":"أنس أحمد شعبان فتحي","sheet":"شاهندة حمادة عبدالفتاح","total":221,"percentage":0.884},{"id":4,"name":"تقوى سيد رجب عبدالرحمن","sheet":"إيمان حمادة شحاتة","total":221,"percentage":0.884},{"id":5,"name":"يامن سامح سيد عبدالتواب","sheet":"إيمان حمادة شحاتة","total":221,"percentage":0.884},{"id":2,"name":"رويدا وليد سيد خالد","sheet":"رقية نصار عبدالمعتمد","total":220.75,"percentage":0.883},{"id":2,"name":"بسمة قرني سيد قرني","sheet":"نورهان محمد شحاتة","total":220.5,"percentage":0.882},{"id":6,"name":"رودينا محمد شعبان عبد الوهاب","sheet":"آية شريف عبدالعظيم رمزي","total":220.5,"percentage":0.882},{"id":7,"name":"على محمود على عبد العزيز","sheet":"آية شريف عبدالعظيم رمزي","total":220.5,"percentage":0.882},{"id":9,"name":"يوسف حمادة يحيى","sheet":"شروق ياسر يوسف","total":220.5,"percentage":0.882},{"id":6,"name":"حمزة نبيل عويس احمد","sheet":"دينا مصطفى كامل","total":220.5,"percentage":0.882},{"id":7,"name":"مصطفى عبد النبى شعبان شحاتة","sheet":"دينا مصطفى كامل","total":220.5,"percentage":0.882},{"id":18,"name":"آدم أحمد علي سعد","sheet":"علياء رجب محمد","total":220.5,"percentage":0.882},{"id":3,"name":"آية حمادة شحاتة عبدالجواد","sheet":"رقية نصار عبدالمعتمد","total":220.25,"percentage":0.881},{"id":4,"name":"منال مصطفى جاب الله حسين","sheet":"مروة حسن قرني","total":220,"percentage":0.88},{"id":8,"name":"حنين محمود على عبد العزيز","sheet":"آية شريف عبدالعظيم رمزي","total":220,"percentage":0.88},{"id":9,"name":"صابرة أحمد محمد محمد","sheet":"فوزية أشرف عوض","total":220,"percentage":0.88},{"id":10,"name":"فاتن شحاتة عبدالوهاب مرزوق","sheet":"آلاء جمال رمضان","total":220,"percentage":0.88},{"id":7,"name":"مروان حسين ربيع حسين","sheet":"منة محمد عبدالعظيم","total":220,"percentage":0.88},{"id":11,"name":"صفا محمد حسين سلامه","sheet":"شاهندة حمادة عبدالفتاح","total":220,"percentage":0.88},{"id":12,"name":"مالك محمود محمد إبراهيم","sheet":"شاهندة حمادة عبدالفتاح","total":220,"percentage":0.88},{"id":10,"name":"حنين محمد مفتاح محمد","sheet":"منة أحمد خليل","total":220,"percentage":0.88},{"id":11,"name":"يوسف أحمد جابر إمام","sheet":"منة أحمد خليل","total":220,"percentage":0.88},{"id":12,"name":"روميساء عباس أحمد عباس","sheet":"حبيبة ربيع مفتاح","total":219.75,"percentage":0.879},{"id":22,"name":"مودة أحمد عبدالعليم سيد","sheet":"صفاء رمضان عبدالوهاب","total":219.5,"percentage":0.878},{"id":10,"name":"سما محمود سيد عباس","sheet":"زينب محمد العريان","total":219.5,"percentage":0.878},{"id":11,"name":"ندى جبر عبدالعليم سيد","sheet":"زينب محمد العريان","total":219.5,"percentage":0.878},{"id":9,"name":"رودينا شامل مصطفى السيد","sheet":"آية شريف عبدالعظيم رمزي","total":219.5,"percentage":0.878},{"id":11,"name":"عائشة جابر أبو المكارم عبدالعزيز","sheet":"آلاء جمال رمضان","total":219.5,"percentage":0.878},{"id":3,"name":"جودي علاء عبدالوهاب عبدالعزيز","sheet":"شروق ياسر يوسف","total":219.5,"percentage":0.878},{"id":9,"name":"رضوى سعد عبدالعال أحمد","sheet":"فاطمة قرني سيد","total":219.5,"percentage":0.878},{"id":8,"name":"أحمد محمد فتحي عبدالتواب","sheet":"منة محمد عبدالعظيم","total":219.5,"percentage":0.878},{"id":12,"name":"لمياء أحمد يوسف إبراهيم","sheet":"منة أحمد خليل","total":219.5,"percentage":0.878},{"id":7,"name":"زياد سيد محمد سيد","sheet":"عبدالرحمن محمد حسن","total":219,"percentage":0.876},{"id":12,"name":"رودينا ياسين سيد ياسين","sheet":"صفاء رمضان عبدالوهاب","total":219,"percentage":0.876},{"id":4,"name":"حنين مصطفى محمد محمود","sheet":"رقية نصار عبدالمعتمد","total":219,"percentage":0.876},{"id":20,"name":"زياد حامد عبد رب النبى داود","sheet":"أسماء جابر محمد","total":219,"percentage":0.876},{"id":9,"name":"محمد كامل رجب كامل","sheet":"منة محمد عبدالعظيم","total":219,"percentage":0.876},{"id":13,"name":"مريم شعبان عمر عبدالمنعم","sheet":"شاهندة حمادة عبدالفتاح","total":219,"percentage":0.876},{"id":9,"name":"تالين أحمد عباس قرني","sheet":"منى علاء جمعة","total":219,"percentage":0.876},{"id":13,"name":"محمد وجيه عباس أحمد","sheet":"منة أحمد خليل","total":219,"percentage":0.876},{"id":14,"name":"مريم أحمد محمد محمد","sheet":"منة أحمد خليل","total":219,"percentage":0.876},{"id":13,"name":"عمر عباس مفتاح إبراهيم","sheet":"غادة ربيع عبدالعال","total":219,"percentage":0.876},{"id":17,"name":"مروة محمد حمادة عبدالله","sheet":"غادة ربيع عبدالعال","total":219,"percentage":0.876},{"id":5,"name":"غادة أحمد رجب عويس","sheet":"مروة حسن قرني","total":218.5,"percentage":0.874},{"id":10,"name":"عمر أحمد سيد حفنى","sheet":"آية شريف عبدالعظيم رمزي","total":218.5,"percentage":0.874},{"id":11,"name":"محمد محمود أحمد سعيد","sheet":"آية شريف عبدالعظيم رمزي","total":218.5,"percentage":0.874},{"id":5,"name":"سجدة سعيد أحمد عباس","sheet":"شروق ياسر يوسف","total":218.25,"percentage":0.873},{"id":8,"name":"مصطفى محمد صادق أمين","sheet":"أسماء شريف عبدالعظم","total":218,"percentage":0.872},{"id":12,"name":"عمر محمد محمود سيد","sheet":"زينب محمد العريان","total":218,"percentage":0.872},{"id":3,"name":"أية محمد حسن محمود","sheet":"شروق ياسر يوسف","total":218,"percentage":0.872},{"id":10,"name":"اسمة سلامة عيد حمزة","sheet":"منة محمد عبدالعظيم","total":218,"percentage":0.872},{"id":11,"name":"أحمد محمد جابر خلف","sheet":"منة محمد عبدالعظيم","total":218,"percentage":0.872},{"id":14,"name":"سهيلة منصور سيد خليفة","sheet":"شاهندة حمادة عبدالفتاح","total":218,"percentage":0.872},{"id":15,"name":"علي عيد جبر تمام","sheet":"شاهندة حمادة عبدالفتاح","total":218,"percentage":0.872},{"id":10,"name":"عمر محمد غانم محمد","sheet":"منى علاء جمعة","total":218,"percentage":0.872},{"id":6,"name":"إيسل أحمد جابر شاكر","sheet":"إيمان حمادة شحاتة","total":218,"percentage":0.872},{"id":7,"name":"أنس شعبان علي جنيدي","sheet":"إيمان حمادة شحاتة","total":218,"percentage":0.872},{"id":15,"name":"آسر أحمد رمضان عبدالرحمن","sheet":"منة أحمد خليل","total":218,"percentage":0.872},{"id":16,"name":"هاجر محمد سيد عطية","sheet":"منة أحمد خليل","total":218,"percentage":0.872},{"id":9,"name":"بسنت أحمد محمد عبدالجواد","sheet":"أسماء شريف عبدالعظم","total":217.5,"percentage":0.87},{"id":16,"name":"مريم شريف حسين علي","sheet":"شروق ياسر يوسف","total":217.5,"percentage":0.87},{"id":6,"name":"شهاب الدين محمد مفتاح عبدالجيد","sheet":"مروة حسن قرني","total":217,"percentage":0.868},{"id":10,"name":"آية سلامة فضالي عويس","sheet":"أسماء شريف عبدالعظم","total":217,"percentage":0.868},{"id":13,"name":"جنا محمد عمر عبدالمنعم","sheet":"صفاء رمضان عبدالوهاب","total":217,"percentage":0.868},{"id":14,"name":"مصطفى محمد طه محمد","sheet":"صفاء رمضان عبدالوهاب","total":217,"percentage":0.868},{"id":20,"name":"محمد علاء محمد قرني","sheet":"شروق ياسر يوسف","total":217,"percentage":0.868},{"id":5,"name":"روان محمد رجب كامل","sheet":"رقية نصار عبدالمعتمد","total":217,"percentage":0.868},{"id":12,"name":"أحلام عبدالعال علي سيد","sheet":"آلاء جمال رمضان","total":217,"percentage":0.868},{"id":21,"name":"أنس أحمد محمد أحمد","sheet":"أسماء جابر محمد","total":217,"percentage":0.868},{"id":6,"name":"عبدالرحمن وجيه برباش جابر","sheet":"حجاج محمد عبدالتواب","total":216.5,"percentage":0.866},{"id":11,"name":"عبدالرحمن قرني عبدالرحمن محمد","sheet":"غادة ربيع عبدالعال","total":216.5,"percentage":0.866},{"id":11,"name":"مريم محمد فضالي عويس","sheet":"أسماء شريف عبدالعظم","total":216,"percentage":0.864},{"id":15,"name":"عباس حمدي فتحي سعيد","sheet":"صفاء رمضان عبدالوهاب","total":216,"percentage":0.864},{"id":1,"name":"آية عماد شعبان محب","sheet":"نورهان محمد شحاتة","total":216,"percentage":0.864},{"id":15,"name":"فريجة أحمد فرج عبدالصالحين","sheet":"بسمة شحاتة شعبان","total":216,"percentage":0.864},{"id":6,"name":"محمد محمود رضوان عبدالحميد","sheet":"رقية نصار عبدالمعتمد","total":216,"percentage":0.864},{"id":8,"name":"رودينا ناصر فتحى جودة","sheet":"دينا مصطفى كامل","total":216,"percentage":0.864},{"id":12,"name":"تبارك نادي أحمد حامد","sheet":"منة محمد عبدالعظيم","total":216,"percentage":0.864},{"id":18,"name":"كارما شعبان إسماعيل سيد","sheet":"حبيبة أحمد حفني","total":216,"percentage":0.864},{"id":8,"name":"عبدالرحمن عبدالوهاب شعبان","sheet":"عبدالرحمن محمد حسن","total":215.5,"percentage":0.862},{"id":13,"name":"حنين احمد عيد سلطان","sheet":"زينب محمد العريان","total":215.5,"percentage":0.862},{"id":2,"name":"بسملة محمد فتحي عبدالسلام","sheet":"نادية سيد سلامة","total":215.5,"percentage":0.862},{"id":16,"name":"رودينا قرني عبدالرحمن محمد","sheet":"بسمة شحاتة شعبان","total":215.5,"percentage":0.862},{"id":7,"name":"روان عصام عبد الحميد صابر","sheet":"رقية نصار عبدالمعتمد","total":215.5,"percentage":0.862},{"id":9,"name":"أحمد أشرف ابراهيم عبدالعزيز","sheet":"دينا مصطفى كامل","total":215.5,"percentage":0.862},{"id":19,"name":"معاذ نادي أحمد حامد","sheet":"غادة ربيع عبدالعال","total":215.5,"percentage":0.862},{"id":19,"name":"فاطمة مصطفى عبدالحسيب إمام","sheet":"فاطمة محمد صادق","total":215,"percentage":0.86},{"id":13,"name":"بلال شعبان سيد خلف","sheet":"منة محمد عبدالعظيم","total":215,"percentage":0.86},{"id":19,"name":"لوجي أحمد رمضان عبدالرحمن","sheet":"حبيبة أحمد حفني","total":215,"percentage":0.86},{"id":16,"name":"مكة مصطفى حسن علي","sheet":"شاهندة حمادة عبدالفتاح","total":215,"percentage":0.86},{"id":2,"name":"آدم جمعة فتح الباب محمد","sheet":"غادة ربيع عبدالعال","total":215,"percentage":0.86},{"id":8,"name":"سما نبيل فتحي عبدالسلام","sheet":"رقية نصار عبدالمعتمد","total":214.75,"percentage":0.859},{"id":4,"name":"رودينا سيد حامد سيد","sheet":"شروق ياسر يوسف","total":214.75,"percentage":0.859},{"id":14,"name":"ندى احمد على عبد العزيز","sheet":"زينب محمد العريان","total":214.5,"percentage":0.858},{"id":1,"name":"أحمد ربيع عبدالحميد محمد","sheet":"شروق ياسر يوسف","total":214.5,"percentage":0.858},{"id":10,"name":"منة عيد عبدالوهاب عبدالحميد","sheet":"فاطمة قرني سيد","total":214.5,"percentage":0.858},{"id":10,"name":"مروان وجيه فاروق محمد","sheet":"دينا مصطفى كامل","total":214.5,"percentage":0.858},{"id":11,"name":"ندى اسماعيل عبدالحسيب امام","sheet":"دينا مصطفى كامل","total":214.5,"percentage":0.858},{"id":8,"name":"أحمد حسين فضالي عويس","sheet":"إيمان حمادة شحاتة","total":214.5,"percentage":0.858},{"id":13,"name":"مريم أحمد جابر إمام","sheet":"حبيبة ربيع مفتاح","total":214,"percentage":0.856},{"id":9,"name":"آية محمد فتحي عبدالسلام","sheet":"رقية نصار عبدالمعتمد","total":214,"percentage":0.856},{"id":12,"name":"ادم محمد صلاح على","sheet":"دينا مصطفى كامل","total":214,"percentage":0.856},{"id":13,"name":"سيد محمد سيد سلامة","sheet":"دينا مصطفى كامل","total":214,"percentage":0.856},{"id":19,"name":"آدم سيد محمد سيد","sheet":"علياء رجب محمد","total":214,"percentage":0.856},{"id":9,"name":"رضوى رمضان رجب عبدالحميد","sheet":"إيمان حمادة شحاتة","total":214,"percentage":0.856},{"id":10,"name":"محمد ربيع علي قرني","sheet":"إيمان حمادة شحاتة","total":214,"percentage":0.856},{"id":11,"name":"مصطفى محمود مصطفى حسين","sheet":"إيمان حمادة شحاتة","total":214,"percentage":0.856},{"id":9,"name":"مصطفى علاء جابر سيد","sheet":"عبدالرحمن محمد حسن","total":213.5,"percentage":0.854},{"id":6,"name":"خالد أحمد محمد محمد","sheet":"شروق ياسر يوسف","total":213.5,"percentage":0.854},{"id":8,"name":"محمد سيد حامد سيد","sheet":"شروق ياسر يوسف","total":213.5,"percentage":0.854},{"id":7,"name":"روفيدة عبدالحليم قرني هبار","sheet":"مروة حسن قرني","total":213,"percentage":0.852},{"id":4,"name":"بسمة عماد رياض خلف","sheet":"شروق ياسر يوسف","total":213,"percentage":0.852},{"id":14,"name":"فريدة أشرف محمد سيد","sheet":"منة محمد عبدالعظيم","total":213,"percentage":0.852},{"id":17,"name":"سيد أحمد بيومي أحمد","sheet":"شاهندة حمادة عبدالفتاح","total":213,"percentage":0.852},{"id":21,"name":"زينة أيمن محمد عبدالمنعم","sheet":"شاهندة حمادة عبدالفتاح","total":213,"percentage":0.852},{"id":11,"name":"ثابت علاء ثابت كمال","sheet":"منى علاء جمعة","total":213,"percentage":0.852},{"id":12,"name":"حفصة رجب خميس عبدالجواد","sheet":"منى علاء جمعة","total":213,"percentage":0.852},{"id":8,"name":"آيه سيد حافظ سيد","sheet":"مروة حسن قرني","total":212.5,"percentage":0.85},{"id":9,"name":"ضحى حمادة عبدالفتاح حامد","sheet":"مروة حسن قرني","total":212.5,"percentage":0.85},{"id":12,"name":"جودي ربيع فتحي موسى","sheet":"أسماء شريف عبدالعظم","total":212.5,"percentage":0.85},{"id":12,"name":"مالك محمود عبد الحليم محمد","sheet":"آية شريف عبدالعظيم رمزي","total":212.5,"percentage":0.85},{"id":5,"name":"جنا عماد جابر شحات","sheet":"شروق ياسر يوسف","total":212.5,"percentage":0.85},{"id":3,"name":"جودى حمادة سلامة أبو العنين","sheet":"غادة ربيع عبدالعال","total":212.5,"percentage":0.85},{"id":18,"name":"جودى حامد ربيع حسين","sheet":"شاهندة حمادة عبدالفتاح","total":212,"percentage":0.848},{"id":13,"name":"ساندي حجازي سيد رزق","sheet":"منى علاء جمعة","total":212,"percentage":0.848},{"id":12,"name":"رقية محمود فتحي أمين","sheet":"إيمان حمادة شحاتة","total":212,"percentage":0.848},{"id":7,"name":"شهاب أحمد رجب كامل","sheet":"حجاج محمد عبدالتواب","total":211.5,"percentage":0.846},{"id":10,"name":"أحمد هاني ممدوح حسن","sheet":"عبدالرحمن محمد حسن","total":211.5,"percentage":0.846},{"id":22,"name":"خالد عبدالوهاب شعبان عبدالوهاب","sheet":"أسماء جابر محمد","total":211.5,"percentage":0.846},{"id":13,"name":"حور أحمد جمال علي","sheet":"إيمان حمادة شحاتة","total":211.5,"percentage":0.846},{"id":14,"name":"عثمان مصطفي عثمان مصطفي","sheet":"إيمان حمادة شحاتة","total":211.5,"percentage":0.846},{"id":17,"name":"معتز عبدالنبي شعبان شحاتة","sheet":"منة أحمد خليل","total":211.5,"percentage":0.846},{"id":13,"name":"جومانا علاء عبدالوهاب عبدالعزيز","sheet":"أسماء شريف عبدالعظم","total":211,"percentage":0.844},{"id":14,"name":"أروى إبراهيم عبدالسلام حسن","sheet":"حبيبة ربيع مفتاح","total":211,"percentage":0.844},{"id":10,"name":"جنا محمود فتحى أمين","sheet":"رقية نصار عبدالمعتمد","total":211,"percentage":0.844},{"id":14,"name":"اسراء رمضان نصر أحمد","sheet":"دينا مصطفى كامل","total":211,"percentage":0.844},{"id":15,"name":"محمد ياسر محمد أحمد","sheet":"منة محمد عبدالعظيم","total":211,"percentage":0.844},{"id":16,"name":"مليكة أنور سيد أنور","sheet":"منة محمد عبدالعظيم","total":211,"percentage":0.844},{"id":20,"name":"مالك أحمد سيد ياسين","sheet":"علياء رجب محمد","total":211,"percentage":0.844},{"id":5,"name":"رقية وجيه برباش جابر","sheet":"غادة ربيع عبدالعال","total":210.75,"percentage":0.843},{"id":6,"name":"شمس سلامة أحمد امام","sheet":"غادة ربيع عبدالعال","total":210.5,"percentage":0.842},{"id":11,"name":"شمس محمد عزت محمد","sheet":"شروق ياسر يوسف","total":210,"percentage":0.84},{"id":13,"name":"عبدالرحمن أحمد رمضان شعبان","sheet":"شروق ياسر يوسف","total":210,"percentage":0.84},{"id":15,"name":"عادل طوسون عادل سيد","sheet":"دينا مصطفى كامل","total":210,"percentage":0.84},{"id":1,"name":"ادم نبيل فتحى عبدالسلام","sheet":"غادة ربيع عبدالعال","total":210,"percentage":0.84},{"id":17,"name":"سجدة رمضان عيد محمد","sheet":"منة محمد عبدالعظيم","total":210,"percentage":0.84},{"id":16,"name":"جنا وجيه عباس أحمد","sheet":"دينا مصطفى كامل","total":209.75,"percentage":0.839},{"id":14,"name":"سارة ربيع فتحي موسى","sheet":"أسماء شريف عبدالعظم","total":209.5,"percentage":0.838},{"id":16,"name":"محمد سيد رمزي أحمد","sheet":"صفاء رمضان عبدالوهاب","total":209.5,"percentage":0.838},{"id":10,"name":"زياد عماد جابر شحات","sheet":"شروق ياسر يوسف","total":209.5,"percentage":0.838},{"id":19,"name":"ملك عصمت مصطفى عبدالعزيز","sheet":"شروق ياسر يوسف","total":209.25,"percentage":0.837},{"id":17,"name":"مصطفى عصمت مصطفى عبدالعزيز","sheet":"شروق ياسر يوسف","total":209,"percentage":0.836},{"id":18,"name":"مكة فضل شحاتة حسن","sheet":"شروق ياسر يوسف","total":209,"percentage":0.836},{"id":17,"name":"عمار محمد سلامة سيد","sheet":"دينا مصطفى كامل","total":209,"percentage":0.836},{"id":18,"name":"محمد عصمت مصطفى عبدالعزيز","sheet":"دينا مصطفى كامل","total":208.5,"percentage":0.834},{"id":21,"name":"آدم أحمد سيد ياسين","sheet":"علياء رجب محمد","total":208.5,"percentage":0.834},{"id":11,"name":"يوسف خميس ممدوح حسن","sheet":"عبدالرحمن محمد حسن","total":208,"percentage":0.832},{"id":15,"name":"حمدي محمود حمدي طه","sheet":"أسماء شريف عبدالعظم","total":208,"percentage":0.832},{"id":15,"name":"محمد وليد عبدالفتاح عبدالحميد","sheet":"شروق ياسر يوسف","total":208,"percentage":0.832},{"id":18,"name":"محمد شريف حسين علي","sheet":"منة محمد عبدالعظيم","total":208,"percentage":0.832},{"id":14,"name":"كارما أشرف خميس عبدالجواد","sheet":"منى علاء جمعة","total":208,"percentage":0.832},{"id":15,"name":"مروة مصطفى علي عبدالعزيز","sheet":"حبيبة ربيع مفتاح","total":207.75,"percentage":0.831},{"id":11,"name":"محمد محمود عبدالحليم محمد","sheet":"رقية نصار عبدالمعتمد","total":207.5,"percentage":0.83},{"id":7,"name":"صفاء هاني محمد توفيق","sheet":"نورهان محمد شحاتة","total":207,"percentage":0.828},{"id":16,"name":"رؤيا محمد أحمد عبدالعزيز","sheet":"حبيبة ربيع مفتاح","total":207,"percentage":0.828},{"id":2,"name":"أحمد حمادة عبدالفتاح حامد","sheet":"غادة ربيع عبدالعال","total":207,"percentage":0.828},{"id":19,"name":"محمد شعبان علي جنيدي","sheet":"شاهندة حمادة عبدالفتاح","total":207,"percentage":0.828},{"id":15,"name":"ساندي عصام ممدوح عبداللطيف","sheet":"منى علاء جمعة","total":207,"percentage":0.828},{"id":12,"name":"عبدالرحمن علاء إمام عبدالرحمن","sheet":"عبدالرحمن محمد حسن","total":206.5,"percentage":0.826},{"id":13,"name":"يوسف علاء جمعة حسين","sheet":"عبدالرحمن محمد حسن","total":206,"percentage":0.824},{"id":10,"name":"رجاء أبوالخير عيسى عبدالجواد","sheet":"فوزية أشرف عوض","total":206,"percentage":0.824},{"id":19,"name":"رؤى ياسر محمد أحمد","sheet":"منة محمد عبدالعظيم","total":206,"percentage":0.824},{"id":1,"name":"إسلام محمد مفتاح أحمد","sheet":"شروق ياسر يوسف","total":205.25,"percentage":0.821},{"id":14,"name":"عبدالله محمد سيد يس","sheet":"عبدالرحمن محمد حسن","total":205,"percentage":0.82},{"id":2,"name":"أحمد صابر عبدالفتاح إبراهيم","sheet":"شروق ياسر يوسف","total":205,"percentage":0.82},{"id":14,"name":"محمد سامي سيد كامل","sheet":"شروق ياسر يوسف","total":205,"percentage":0.82},{"id":12,"name":"ياسمين محمود شعبان محب","sheet":"رقية نصار عبدالمعتمد","total":205,"percentage":0.82},{"id":11,"name":"عزة فتحي عبدالتواب عوض","sheet":"فوزية أشرف عوض","total":205,"percentage":0.82},{"id":6,"name":"عمر مصطفى قرني محمد","sheet":"شروق ياسر يوسف","total":205,"percentage":0.82},{"id":2,"name":"جنا محمد عبدالتواب عبدالوهاب","sheet":"شروق ياسر يوسف","total":204,"percentage":0.816},{"id":22,"name":"مصطفى ربيع شعبان سيد","sheet":"علياء رجب محمد","total":204,"percentage":0.816},{"id":13,"name":"محمد عثمان أحمد عثمان","sheet":"آية شريف عبدالعظيم رمزي","total":203.5,"percentage":0.814},{"id":12,"name":"صفا ربيع قرنى هبار","sheet":"شروق ياسر يوسف","total":203.5,"percentage":0.814},{"id":20,"name":"عمر فضل شحاتة حسن","sheet":"منة محمد عبدالعظيم","total":203,"percentage":0.812},{"id":16,"name":"عمار سيد حافظ سيد","sheet":"منى علاء جمعة","total":203,"percentage":0.812},{"id":10,"name":"شهد محمود جبر شحاتة","sheet":"مروة حسن قرني","total":202,"percentage":0.808},{"id":19,"name":"يوسف محمد حمدى سيد","sheet":"دينا مصطفى كامل","total":202,"percentage":0.808},{"id":10,"name":"محمد محمود عيد متولى","sheet":"غادة ربيع عبدالعال","total":202,"percentage":0.808},{"id":17,"name":"أمنية محمد حمدي سيد","sheet":"منى علاء جمعة","total":202,"percentage":0.808},{"id":18,"name":"عبد الرحمن محمود رضوان","sheet":"منى علاء جمعة","total":202,"percentage":0.808},{"id":15,"name":"بدرالدين أيمن عبدالفتاح أحمد","sheet":"عبدالرحمن محمد حسن","total":201.5,"percentage":0.806},{"id":17,"name":"مروان محمود رضوان عبدالحميد","sheet":"صفاء رمضان عبدالوهاب","total":200.5,"percentage":0.802},{"id":9,"name":"مازن محمد عمر عبدالمنعم","sheet":"غادة ربيع عبدالعال","total":200.5,"percentage":0.802},{"id":8,"name":"عمر شعبان محمد سيد","sheet":"غادة ربيع عبدالعال","total":200,"percentage":0.8},{"id":20,"name":"حمزة عبدالحليم محمد إبراهيم","sheet":"شاهندة حمادة عبدالفتاح","total":200,"percentage":0.8},{"id":16,"name":"محمد عماد شعبان محب","sheet":"عبدالرحمن محمد حسن","total":199.5,"percentage":0.798},{"id":21,"name":"روان ربيع عطية عوض","sheet":"منة محمد عبدالعظيم","total":199,"percentage":0.796},{"id":13,"name":"سلوى مفتاح محمد فرغلي","sheet":"آلاء جمال رمضان","total":198,"percentage":0.792},{"id":19,"name":"إياد وجيه جمال جابر","sheet":"منى علاء جمعة","total":198,"percentage":0.792},{"id":15,"name":"ياسر محمد سلامة سيد","sheet":"إيمان حمادة شحاتة","total":198,"percentage":0.792},{"id":4,"name":"حنين محمد فتحى عبدالسلام","sheet":"غادة ربيع عبدالعال","total":197.5,"percentage":0.79},{"id":7,"name":"شهاب محسن مختار كامل","sheet":"غادة ربيع عبدالعال","total":197,"percentage":0.788},{"id":11,"name":"مروان نادى مختار كامل","sheet":"غادة ربيع عبدالعال","total":197,"percentage":0.788},{"id":23,"name":"أحمد سيد محمد سيد","sheet":"علياء رجب محمد","total":197,"percentage":0.788},{"id":11,"name":"ملك محمد فضالي عويس","sheet":"مروة حسن قرني","total":196,"percentage":0.784},{"id":16,"name":"عباس وجيه عباس أحمد","sheet":"إيمان حمادة شحاتة","total":195,"percentage":0.78},{"id":13,"name":"روضة ربيع قرني هبار","sheet":"رقية نصار عبدالمعتمد","total":194.5,"percentage":0.778},{"id":3,"name":"جنى ربيع رمضان عبدالحميد","sheet":"نورهان محمد شحاتة","total":191,"percentage":0.764},{"id":17,"name":"بسنت عماد رياض خلف","sheet":"إيمان حمادة شحاتة","total":189,"percentage":0.756},{"id":12,"name":"فرحة عماد علي شاكر","sheet":"مروة حسن قرني","total":188.5,"percentage":0.754},{"id":22,"name":"أثينات محمد أحمد عباس","sheet":"منة محمد عبدالعظيم","total":188,"percentage":0.752},{"id":8,"name":"منة صابر عبدالفتاح إبراهيم","sheet":"نورهان محمد شحاتة","total":187.5,"percentage":0.75},{"id":17,"name":"محمد أيمن عبدالفتاح أحمد","sheet":"عبدالرحمن محمد حسن","total":184,"percentage":0.736},{"id":18,"name":"أحمد عباس أحمد عباس","sheet":"عبدالرحمن محمد حسن","total":181,"percentage":0.724},{"id":18,"name":"ريان عمر إسماعيل سيد","sheet":"صفاء رمضان عبدالوهاب","total":141.5,"percentage":0.566},{"id":19,"name":"آدم عمر إسماعيل سيد","sheet":"صفاء رمضان عبدالوهاب","total":140.5,"percentage":0.562},{"id":11,"name":"إسراء صابر عبدالفتاح إبراهيم","sheet":"فاطمة قرني سيد","total":136.75,"percentage":0.547},{"id":22,"name":"محمود أحمد عبدالعزيز روبي","sheet":"شاهندة حمادة عبدالفتاح","total":129,"percentage":0.516},{"id":20,"name":"مروان رجب عثمان قطب","sheet":"صفاء رمضان عبدالوهاب","total":125,"percentage":0.5},{"id":21,"name":"وعد رجب عثمان قطب","sheet":"صفاء رمضان عبدالوهاب","total":122,"percentage":0.488},{"id":5,"name":"سومية حنفي محمود جودة","sheet":"نادية سيد سلامة","total":118.5,"percentage":0.474},{"id":16,"name":"زينب محمد عبدالفتاح محمد","sheet":"فوزية أشرف عوض","total":118,"percentage":0.472},{"id":6,"name":"منة ربيع عصمت محمد","sheet":"نادية سيد سلامة","total":117.5,"percentage":0.47},{"id":8,"name":"روضة أحمد جمعة إسماعيل","sheet":"شروق ياسر يوسف","total":117.5,"percentage":0.47},{"id":7,"name":"وفاء طه حلمى عبد الوهاب","sheet":"نادية سيد سلامة","total":116.5,"percentage":0.466},{"id":15,"name":"أسماء ربيع ذكى","sheet":"فوزية أشرف عوض","total":115.5,"percentage":0.462},{"id":14,"name":"فوزية سيد حفني حسن","sheet":"آلاء جمال رمضان","total":115.5,"percentage":0.462},{"id":12,"name":"هالة محمد عبدالحميد طه","sheet":"فوزية أشرف عوض","total":115,"percentage":0.46},{"id":14,"name":"دينا رأفت عيسى محمد","sheet":"فوزية أشرف عوض","total":114.5,"percentage":0.458},{"id":15,"name":"أميرة أبوالخير عبدالعظيم محمد","sheet":"آلاء جمال رمضان","total":112.5,"percentage":0.45},{"id":17,"name":"شروق مصطفى شعبان أحمد","sheet":"فوزية أشرف عوض","total":111,"percentage":0.444},{"id":13,"name":"عزة حجاج عبدالمنعم محمد","sheet":"فوزية أشرف عوض","total":109.5,"percentage":0.438},{"id":3,"name":"دينا أحمد قرني محمد","sheet":"نادية سيد سلامة","total":91,"percentage":0.364},{"id":1,"name":"إيمان أحمد عرفات سيد","sheet":"نادية سيد سلامة","total":20,"percentage":0.08}];

export const teacherData = {
  "فاطمة محمد صادق": {
    "name": "فاطمة محمد صادق",
    "students": [
      {
        "id": 1,
        "name": "منة محمود عويس محمود",
        "sheet": "فاطمة محمد صادق",
        "total": 244.5,
        "percentage": 0.978
      },
      {
        "id": 2,
        "name": "جنا رجب فتحي سيد",
        "sheet": "فاطمة محمد صادق",
        "total": 242,
        "percentage": 0.968
      },
      {
        "id": 3,
        "name": "منة الله إمام محمد إمام",
        "sheet": "فاطمة محمد صادق",
        "total": 241.5,
        "percentage": 0.966
      },
      {
        "id": 4,
        "name": "رحيق محمد شحاتة متولي",
        "sheet": "فاطمة محمد صادق",
        "total": 236.75,
        "percentage": 0.947
      },
      {
        "id": 5,
        "name": "سنة الله محمد سيد عطية",
        "sheet": "فاطمة محمد صادق",
        "total": 236,
        "percentage": 0.944
      },
      {
        "id": 6,
        "name": "هاجر أحمد قرني محمد",
        "sheet": "فاطمة محمد صادق",
        "total": 236,
        "percentage": 0.944
      },
      {
        "id": 7,
        "name": "رحمة محمد عرفات سيد",
        "sheet": "فاطمة محمد صادق",
        "total": 235.25,
        "percentage": 0.941
      },
      {
        "id": 8,
        "name": "هنا محمود حمدي أحمد",
        "sheet": "فاطمة محمد صادق",
        "total": 234.5,
        "percentage": 0.938
      },
      {
        "id": 9,
        "name": "حمزة محمد زكريا سليمان",
        "sheet": "فاطمة محمد صادق",
        "total": 233.5,
        "percentage": 0.934
      },
      {
        "id": 10,
        "name": "رأفت أحمد رشاد حسن",
        "sheet": "فاطمة محمد صادق",
        "total": 232.5,
        "percentage": 0.93
      },
      {
        "id": 11,
        "name": "ياسين محمد زكريا سليمان",
        "sheet": "فاطمة محمد صادق",
        "total": 231.5,
        "percentage": 0.926
      },
      {
        "id": 12,
        "name": "ملك أحمد عبدالله عبدالنبي",
        "sheet": "فاطمة محمد صادق",
        "total": 230.5,
        "percentage": 0.922
      },
      {
        "id": 13,
        "name": "أبرار سلامة إبراهيم أمين",
        "sheet": "فاطمة محمد صادق",
        "total": 230,
        "percentage": 0.92
      },
      {
        "id": 14,
        "name": "أحمد شعبان أحمد محمد",
        "sheet": "فاطمة محمد صادق",
        "total": 228.5,
        "percentage": 0.914
      },
      {
        "id": 15,
        "name": "حبيبة محمد عرفات سيد علي",
        "sheet": "فاطمة محمد صادق",
        "total": 228.5,
        "percentage": 0.914
      },
      {
        "id": 16,
        "name": "جنا محمود حمدي أحمد",
        "sheet": "فاطمة محمد صادق",
        "total": 227.75,
        "percentage": 0.911
      },
      {
        "id": 17,
        "name": "سما محمد سعد محمد",
        "sheet": "فاطمة محمد صادق",
        "total": 227.25,
        "percentage": 0.909
      },
      {
        "id": 18,
        "name": "رويدا رجب فتحي سيد",
        "sheet": "فاطمة محمد صادق",
        "total": 224,
        "percentage": 0.896
      },
      {
        "id": 19,
        "name": "فاطمة مصطفى عبدالحسيب إمام",
        "sheet": "فاطمة محمد صادق",
        "total": 215,
        "percentage": 0.86
      }
    ],
    "grades": {
      "امتياز": 17,
      "جيد جدا": 2,
      "جيد": 0,
      "مقبول": 0,
      "راسب": 0
    },
    "total": 19
  },
  "نورهان محمد شحاتة": {
    "name": "نورهان محمد شحاتة",
    "students": [
      {
        "id": 6,
        "name": "سلمى عصام عبدالعظيم معوض",
        "sheet": "نورهان محمد شحاتة",
        "total": 244.25,
        "percentage": 0.977
      },
      {
        "id": 9,
        "name": "منى رجب محمد محمد",
        "sheet": "نورهان محمد شحاتة",
        "total": 234.5,
        "percentage": 0.938
      },
      {
        "id": 5,
        "name": "حنين شامل مصطفى سيد",
        "sheet": "نورهان محمد شحاتة",
        "total": 232,
        "percentage": 0.928
      },
      {
        "id": 4,
        "name": "جنى سلامه صبرى شحاته",
        "sheet": "نورهان محمد شحاتة",
        "total": 226.5,
        "percentage": 0.906
      },
      {
        "id": 2,
        "name": "بسمة قرني سيد قرني",
        "sheet": "نورهان محمد شحاتة",
        "total": 220.5,
        "percentage": 0.882
      },
      {
        "id": 1,
        "name": "آية عماد شعبان محب",
        "sheet": "نورهان محمد شحاتة",
        "total": 216,
        "percentage": 0.864
      },
      {
        "id": 7,
        "name": "صفاء هاني محمد توفيق",
        "sheet": "نورهان محمد شحاتة",
        "total": 207,
        "percentage": 0.828
      },
      {
        "id": 3,
        "name": "جنى ربيع رمضان عبدالحميد",
        "sheet": "نورهان محمد شحاتة",
        "total": 191,
        "percentage": 0.764
      },
      {
        "id": 8,
        "name": "منة صابر عبدالفتاح إبراهيم",
        "sheet": "نورهان محمد شحاتة",
        "total": 187.5,
        "percentage": 0.75
      }
    ],
    "grades": {
      "امتياز": 4,
      "جيد جدا": 3,
      "جيد": 2,
      "مقبول": 0,
      "راسب": 0
    },
    "total": 9
  },
  "أسماء عبدالموجود صالح": {
    "name": "أسماء عبدالموجود صالح",
    "students": [
      {
        "id": 1,
        "name": "مريم محمد محمود موسى",
        "sheet": "أسماء عبدالموجود صالح",
        "total": 244,
        "percentage": 0.976
      },
      {
        "id": 2,
        "name": "محمد محمود سيد حسين",
        "sheet": "أسماء عبدالموجود صالح",
        "total": 239,
        "percentage": 0.956
      },
      {
        "id": 3,
        "name": "جودي عماد عمر عبدالمنعم",
        "sheet": "أسماء عبدالموجود صالح",
        "total": 238,
        "percentage": 0.952
      },
      {
        "id": 4,
        "name": "دينا أحمد جلال عبدالجواد",
        "sheet": "أسماء عبدالموجود صالح",
        "total": 238,
        "percentage": 0.952
      },
      {
        "id": 5,
        "name": "رقية مؤمن يحى محمود",
        "sheet": "أسماء عبدالموجود صالح",
        "total": 236.75,
        "percentage": 0.947
      },
      {
        "id": 6,
        "name": "محمد أحمد قرني سليمان",
        "sheet": "أسماء عبدالموجود صالح",
        "total": 236,
        "percentage": 0.944
      },
      {
        "id": 7,
        "name": "أميره أحمد عبدالله عبدالنبي",
        "sheet": "أسماء عبدالموجود صالح",
        "total": 234,
        "percentage": 0.936
      },
      {
        "id": 8,
        "name": "ريتاج ربيع أحمد عبدالعليم",
        "sheet": "أسماء عبدالموجود صالح",
        "total": 232,
        "percentage": 0.928
      },
      {
        "id": 9,
        "name": "ماهر أحمد عبدالعزيز روبي",
        "sheet": "أسماء عبدالموجود صالح",
        "total": 230,
        "percentage": 0.92
      },
      {
        "id": 10,
        "name": "محمد أحمد عبدالله عبدالنبي",
        "sheet": "أسماء عبدالموجود صالح",
        "total": 230,
        "percentage": 0.92
      },
      {
        "id": 11,
        "name": "حفصة أحمد حامد شحاتة",
        "sheet": "أسماء عبدالموجود صالح",
        "total": 229.5,
        "percentage": 0.918
      },
      {
        "id": 12,
        "name": "محمد رجب عثمان قطب",
        "sheet": "أسماء عبدالموجود صالح",
        "total": 229.5,
        "percentage": 0.918
      },
      {
        "id": 13,
        "name": "شمس محمد حسني حامد",
        "sheet": "أسماء عبدالموجود صالح",
        "total": 229,
        "percentage": 0.916
      },
      {
        "id": 14,
        "name": "ياسمين محمود سالم عبدالعليم",
        "sheet": "أسماء عبدالموجود صالح",
        "total": 228,
        "percentage": 0.912
      },
      {
        "id": 15,
        "name": "صفاء أحمد حامد شحاتة",
        "sheet": "أسماء عبدالموجود صالح",
        "total": 227.5,
        "percentage": 0.91
      },
      {
        "id": 16,
        "name": "مصطفى محمود صلاح عيسى",
        "sheet": "أسماء عبدالموجود صالح",
        "total": 227.5,
        "percentage": 0.91
      },
      {
        "id": 17,
        "name": "روفيدة وليد سيد خالد",
        "sheet": "أسماء عبدالموجود صالح",
        "total": 226.5,
        "percentage": 0.906
      },
      {
        "id": 18,
        "name": "إياد محمد حسني حامد",
        "sheet": "أسماء عبدالموجود صالح",
        "total": 225.5,
        "percentage": 0.902
      },
      {
        "id": 19,
        "name": "شمس علي عويس محمود",
        "sheet": "أسماء عبدالموجود صالح",
        "total": 225.5,
        "percentage": 0.902
      },
      {
        "id": 20,
        "name": "رحمة محمد رمضان صديق",
        "sheet": "أسماء عبدالموجود صالح",
        "total": 222.5,
        "percentage": 0.89
      }
    ],
    "grades": {
      "امتياز": 19,
      "جيد جدا": 1,
      "جيد": 0,
      "مقبول": 0,
      "راسب": 0
    },
    "total": 20
  },
  "أسماء جابر محمد": {
    "name": "أسماء جابر محمد",
    "students": [
      {
        "id": 1,
        "name": "حمزة حسين فضالي عويس",
        "sheet": "أسماء جابر محمد",
        "total": 242.25,
        "percentage": 0.969
      },
      {
        "id": 2,
        "name": "رودينا محمود صلاح عيسى",
        "sheet": "أسماء جابر محمد",
        "total": 239.5,
        "percentage": 0.958
      },
      {
        "id": 3,
        "name": "حنين سيد عويس قطب",
        "sheet": "أسماء جابر محمد",
        "total": 238.25,
        "percentage": 0.953
      },
      {
        "id": 4,
        "name": "فاطمة شريف حسين علي",
        "sheet": "أسماء جابر محمد",
        "total": 237.5,
        "percentage": 0.95
      },
      {
        "id": 5,
        "name": "فاطمة الزهراء محمود زكريا سليمان",
        "sheet": "أسماء جابر محمد",
        "total": 231.75,
        "percentage": 0.927
      },
      {
        "id": 6,
        "name": "ملك إسلام محمود جابر",
        "sheet": "أسماء جابر محمد",
        "total": 231.5,
        "percentage": 0.926
      },
      {
        "id": 7,
        "name": "علي محمود عبدالفضيل عبدالمجيد",
        "sheet": "أسماء جابر محمد",
        "total": 230,
        "percentage": 0.92
      },
      {
        "id": 8,
        "name": "يمنى حامد عبدالنبي داود",
        "sheet": "أسماء جابر محمد",
        "total": 228.75,
        "percentage": 0.915
      },
      {
        "id": 9,
        "name": "ملك محمد علي حسين",
        "sheet": "أسماء جابر محمد",
        "total": 228,
        "percentage": 0.912
      },
      {
        "id": 10,
        "name": "جنة أحمد عبدالمنعم صادق",
        "sheet": "أسماء جابر محمد",
        "total": 228,
        "percentage": 0.912
      },
      {
        "id": 11,
        "name": "ندى محمد زكريا سليمان",
        "sheet": "أسماء جابر محمد",
        "total": 228,
        "percentage": 0.912
      },
      {
        "id": 12,
        "name": "حبيبة محمود عبدالفضيل عبدالحميد",
        "sheet": "أسماء جابر محمد",
        "total": 227.25,
        "percentage": 0.909
      },
      {
        "id": 13,
        "name": "رودينا أحمد يوسف إبراهيم",
        "sheet": "أسماء جابر محمد",
        "total": 226.25,
        "percentage": 0.905
      },
      {
        "id": 14,
        "name": "فيروز إيهاب محمد عبدالرحمن",
        "sheet": "أسماء جابر محمد",
        "total": 225.75,
        "percentage": 0.903
      },
      {
        "id": 15,
        "name": "أنس محمود إسماعيل حامد",
        "sheet": "أسماء جابر محمد",
        "total": 225.5,
        "percentage": 0.902
      },
      {
        "id": 16,
        "name": "أبرار عماد رمضان عبدالله",
        "sheet": "أسماء جابر محمد",
        "total": 225,
        "percentage": 0.9
      },
      {
        "id": 17,
        "name": "ريماس محمد عبدالعزيز صادق",
        "sheet": "أسماء جابر محمد",
        "total": 224.75,
        "percentage": 0.899
      },
      {
        "id": 18,
        "name": "رقية أحمد عويس عبدالله",
        "sheet": "أسماء جابر محمد",
        "total": 223.5,
        "percentage": 0.894
      },
      {
        "id": 19,
        "name": "محمد سعيد أحمد عباس",
        "sheet": "أسماء جابر محمد",
        "total": 222,
        "percentage": 0.888
      },
      {
        "id": 20,
        "name": "زياد حامد عبد رب النبى داود",
        "sheet": "أسماء جابر محمد",
        "total": 219,
        "percentage": 0.876
      },
      {
        "id": 21,
        "name": "أنس أحمد محمد أحمد",
        "sheet": "أسماء جابر محمد",
        "total": 217,
        "percentage": 0.868
      },
      {
        "id": 22,
        "name": "خالد عبدالوهاب شعبان عبدالوهاب",
        "sheet": "أسماء جابر محمد",
        "total": 211.5,
        "percentage": 0.846
      }
    ],
    "grades": {
      "امتياز": 16,
      "جيد جدا": 6,
      "جيد": 0,
      "مقبول": 0,
      "راسب": 0
    },
    "total": 22
  },
  "أسماء شريف عبدالعظم": {
    "name": "أسماء شريف عبدالعظم",
    "students": [
      {
        "id": 1,
        "name": "حنين محمود سالم عبدالعليم",
        "sheet": "أسماء شريف عبدالعظم",
        "total": 241.5,
        "percentage": 0.966
      },
      {
        "id": 2,
        "name": "ملك أكرم شعبان سيد",
        "sheet": "أسماء شريف عبدالعظم",
        "total": 234,
        "percentage": 0.936
      },
      {
        "id": 3,
        "name": "جنا رمضان سيد قرني",
        "sheet": "أسماء شريف عبدالعظم",
        "total": 233.75,
        "percentage": 0.935
      },
      {
        "id": 4,
        "name": "جودي محمود محمد",
        "sheet": "أسماء شريف عبدالعظم",
        "total": 229,
        "percentage": 0.916
      },
      {
        "id": 5,
        "name": "منة محمد سيد عويس",
        "sheet": "أسماء شريف عبدالعظم",
        "total": 228,
        "percentage": 0.912
      },
      {
        "id": 6,
        "name": "عبدالله فارس سمير موسى",
        "sheet": "أسماء شريف عبدالعظم",
        "total": 225,
        "percentage": 0.9
      },
      {
        "id": 7,
        "name": "هاجر أدهم محمد إبراهيم",
        "sheet": "أسماء شريف عبدالعظم",
        "total": 224.5,
        "percentage": 0.898
      },
      {
        "id": 8,
        "name": "مصطفى محمد صادق أمين",
        "sheet": "أسماء شريف عبدالعظم",
        "total": 218,
        "percentage": 0.872
      },
      {
        "id": 9,
        "name": "بسنت أحمد محمد عبدالجواد",
        "sheet": "أسماء شريف عبدالعظم",
        "total": 217.5,
        "percentage": 0.87
      },
      {
        "id": 10,
        "name": "آية سلامة فضالي عويس",
        "sheet": "أسماء شريف عبدالعظم",
        "total": 217,
        "percentage": 0.868
      },
      {
        "id": 11,
        "name": "مريم محمد فضالي عويس",
        "sheet": "أسماء شريف عبدالعظم",
        "total": 216,
        "percentage": 0.864
      },
      {
        "id": 12,
        "name": "جودي ربيع فتحي موسى",
        "sheet": "أسماء شريف عبدالعظم",
        "total": 212.5,
        "percentage": 0.85
      },
      {
        "id": 13,
        "name": "جومانا علاء عبدالوهاب عبدالعزيز",
        "sheet": "أسماء شريف عبدالعظم",
        "total": 211,
        "percentage": 0.844
      },
      {
        "id": 14,
        "name": "سارة ربيع فتحي موسى",
        "sheet": "أسماء شريف عبدالعظم",
        "total": 209.5,
        "percentage": 0.838
      },
      {
        "id": 15,
        "name": "حمدي محمود حمدي طه",
        "sheet": "أسماء شريف عبدالعظم",
        "total": 208,
        "percentage": 0.832
      }
    ],
    "grades": {
      "امتياز": 6,
      "جيد جدا": 9,
      "جيد": 0,
      "مقبول": 0,
      "راسب": 0
    },
    "total": 15
  },
  "حبيبة أحمد حفني": {
    "name": "حبيبة أحمد حفني",
    "students": [
      {
        "id": 1,
        "name": "يارا أحمد جابر شاكر",
        "sheet": "حبيبة أحمد حفني",
        "total": 241,
        "percentage": 0.964
      },
      {
        "id": 2,
        "name": "ساجد محمد رمضان محمود",
        "sheet": "حبيبة أحمد حفني",
        "total": 238,
        "percentage": 0.952
      },
      {
        "id": 3,
        "name": "أنس شوقي أحمد محمد",
        "sheet": "حبيبة أحمد حفني",
        "total": 237.5,
        "percentage": 0.95
      },
      {
        "id": 4,
        "name": "كنوز علي شحاتة حسن",
        "sheet": "حبيبة أحمد حفني",
        "total": 237.5,
        "percentage": 0.95
      },
      {
        "id": 5,
        "name": "مكة علي سيد عطية",
        "sheet": "حبيبة أحمد حفني",
        "total": 237,
        "percentage": 0.948
      },
      {
        "id": 6,
        "name": "ملك أحمد عويس عبدالله",
        "sheet": "حبيبة أحمد حفني",
        "total": 237,
        "percentage": 0.948
      },
      {
        "id": 7,
        "name": "رقية مفتاح سيد عبدالحميد",
        "sheet": "حبيبة أحمد حفني",
        "total": 235,
        "percentage": 0.94
      },
      {
        "id": 8,
        "name": "علياء إيهاب سيد عبدالعظيم",
        "sheet": "حبيبة أحمد حفني",
        "total": 234,
        "percentage": 0.936
      },
      {
        "id": 9,
        "name": "محمد أحمد عويس عبدالله",
        "sheet": "حبيبة أحمد حفني",
        "total": 232.5,
        "percentage": 0.93
      },
      {
        "id": 10,
        "name": "علي محمد سيد عطية",
        "sheet": "حبيبة أحمد حفني",
        "total": 231.5,
        "percentage": 0.926
      },
      {
        "id": 11,
        "name": "أنس أحمد عبدالفتاح محمد",
        "sheet": "حبيبة أحمد حفني",
        "total": 230.5,
        "percentage": 0.922
      },
      {
        "id": 12,
        "name": "كرمة حمادة فتحي أبوالنجا",
        "sheet": "حبيبة أحمد حفني",
        "total": 230,
        "percentage": 0.92
      },
      {
        "id": 13,
        "name": "محمد علي سيد عطية",
        "sheet": "حبيبة أحمد حفني",
        "total": 229,
        "percentage": 0.916
      },
      {
        "id": 14,
        "name": "ملك أحمد عبدالفتاح محمد",
        "sheet": "حبيبة أحمد حفني",
        "total": 228.5,
        "percentage": 0.914
      },
      {
        "id": 15,
        "name": "الحسين أيمن عبدالفتاح أحمد",
        "sheet": "حبيبة أحمد حفني",
        "total": 227,
        "percentage": 0.908
      },
      {
        "id": 16,
        "name": "الحسن أيمن عبدالفتاح أحمد",
        "sheet": "حبيبة أحمد حفني",
        "total": 224,
        "percentage": 0.896
      },
      {
        "id": 17,
        "name": "حنين إبراهيم عبداللطيف إسماعيل",
        "sheet": "حبيبة أحمد حفني",
        "total": 224,
        "percentage": 0.896
      },
      {
        "id": 18,
        "name": "كارما شعبان إسماعيل سيد",
        "sheet": "حبيبة أحمد حفني",
        "total": 216,
        "percentage": 0.864
      },
      {
        "id": 19,
        "name": "لوجي أحمد رمضان عبدالرحمن",
        "sheet": "حبيبة أحمد حفني",
        "total": 215,
        "percentage": 0.86
      }
    ],
    "grades": {
      "امتياز": 15,
      "جيد جدا": 4,
      "جيد": 0,
      "مقبول": 0,
      "راسب": 0
    },
    "total": 19
  },
  "غادة ربيع عبدالعال": {
    "name": "غادة ربيع عبدالعال",
    "students": [
      {
        "id": 5,
        "name": "جنا شريف شحاتة علي",
        "sheet": "غادة ربيع عبدالعال",
        "total": 241,
        "percentage": 0.964
      },
      {
        "id": 12,
        "name": "عبدالرحمن محمود سيد حسين",
        "sheet": "غادة ربيع عبدالعال",
        "total": 235.5,
        "percentage": 0.942
      },
      {
        "id": 7,
        "name": "زياد أحمد عطية محمد",
        "sheet": "غادة ربيع عبدالعال",
        "total": 232,
        "percentage": 0.928
      },
      {
        "id": 9,
        "name": "شهد محمد غانم محمد",
        "sheet": "غادة ربيع عبدالعال",
        "total": 231,
        "percentage": 0.924
      },
      {
        "id": 4,
        "name": "باسل أحمد محمد عبدالعزيز",
        "sheet": "غادة ربيع عبدالعال",
        "total": 230.5,
        "percentage": 0.922
      },
      {
        "id": 18,
        "name": "مريم عبدالعال محمد عبداللطيف",
        "sheet": "غادة ربيع عبدالعال",
        "total": 230.5,
        "percentage": 0.922
      },
      {
        "id": 8,
        "name": "سيف سيد مغازي عبدالجواد",
        "sheet": "غادة ربيع عبدالعال",
        "total": 228,
        "percentage": 0.912
      },
      {
        "id": 20,
        "name": "يحيى كمال جابر عبدالعزيز",
        "sheet": "غادة ربيع عبدالعال",
        "total": 227.5,
        "percentage": 0.91
      },
      {
        "id": 3,
        "name": "آية سامح حامد محمد",
        "sheet": "غادة ربيع عبدالعال",
        "total": 227,
        "percentage": 0.908
      },
      {
        "id": 6,
        "name": "جنى حامد ربيع حامد",
        "sheet": "غادة ربيع عبدالعال",
        "total": 227,
        "percentage": 0.908
      },
      {
        "id": 1,
        "name": "أنس سامح حامد محمد",
        "sheet": "غادة ربيع عبدالعال",
        "total": 226.5,
        "percentage": 0.906
      },
      {
        "id": 15,
        "name": "محمد أكرم إسماعيل سيد",
        "sheet": "غادة ربيع عبدالعال",
        "total": 224,
        "percentage": 0.896
      },
      {
        "id": 10,
        "name": "صفا محمد حمادة عبدالله",
        "sheet": "غادة ربيع عبدالعال",
        "total": 223,
        "percentage": 0.892
      },
      {
        "id": 14,
        "name": "محمد أحمد محمد عبدالعزيز",
        "sheet": "غادة ربيع عبدالعال",
        "total": 222,
        "percentage": 0.888
      },
      {
        "id": 16,
        "name": "محمد سيد محمد علي",
        "sheet": "غادة ربيع عبدالعال",
        "total": 221.5,
        "percentage": 0.886
      },
      {
        "id": 12,
        "name": "ندى محمد فضالى عويس",
        "sheet": "غادة ربيع عبدالعال",
        "total": 221,
        "percentage": 0.884
      },
      {
        "id": 13,
        "name": "عمر عباس مفتاح إبراهيم",
        "sheet": "غادة ربيع عبدالعال",
        "total": 219,
        "percentage": 0.876
      },
      {
        "id": 17,
        "name": "مروة محمد حمادة عبدالله",
        "sheet": "غادة ربيع عبدالعال",
        "total": 219,
        "percentage": 0.876
      },
      {
        "id": 11,
        "name": "عبدالرحمن قرني عبدالرحمن محمد",
        "sheet": "غادة ربيع عبدالعال",
        "total": 216.5,
        "percentage": 0.866
      },
      {
        "id": 19,
        "name": "معاذ نادي أحمد حامد",
        "sheet": "غادة ربيع عبدالعال",
        "total": 215.5,
        "percentage": 0.862
      },
      {
        "id": 2,
        "name": "آدم جمعة فتح الباب محمد",
        "sheet": "غادة ربيع عبدالعال",
        "total": 215,
        "percentage": 0.86
      },
      {
        "id": 3,
        "name": "جودى حمادة سلامة أبو العنين",
        "sheet": "غادة ربيع عبدالعال",
        "total": 212.5,
        "percentage": 0.85
      },
      {
        "id": 5,
        "name": "رقية وجيه برباش جابر",
        "sheet": "غادة ربيع عبدالعال",
        "total": 210.75,
        "percentage": 0.843
      },
      {
        "id": 6,
        "name": "شمس سلامة أحمد امام",
        "sheet": "غادة ربيع عبدالعال",
        "total": 210.5,
        "percentage": 0.842
      },
      {
        "id": 1,
        "name": "ادم نبيل فتحى عبدالسلام",
        "sheet": "غادة ربيع عبدالعال",
        "total": 210,
        "percentage": 0.84
      },
      {
        "id": 2,
        "name": "أحمد حمادة عبدالفتاح حامد",
        "sheet": "غادة ربيع عبدالعال",
        "total": 207,
        "percentage": 0.828
      },
      {
        "id": 10,
        "name": "محمد محمود عيد متولى",
        "sheet": "غادة ربيع عبدالعال",
        "total": 202,
        "percentage": 0.808
      },
      {
        "id": 9,
        "name": "مازن محمد عمر عبدالمنعم",
        "sheet": "غادة ربيع عبدالعال",
        "total": 200.5,
        "percentage": 0.802
      },
      {
        "id": 8,
        "name": "عمر شعبان محمد سيد",
        "sheet": "غادة ربيع عبدالعال",
        "total": 200,
        "percentage": 0.8
      },
      {
        "id": 4,
        "name": "حنين محمد فتحى عبدالسلام",
        "sheet": "غادة ربيع عبدالعال",
        "total": 197.5,
        "percentage": 0.79
      },
      {
        "id": 7,
        "name": "شهاب محسن مختار كامل",
        "sheet": "غادة ربيع عبدالعال",
        "total": 197,
        "percentage": 0.788
      },
      {
        "id": 11,
        "name": "مروان نادى مختار كامل",
        "sheet": "غادة ربيع عبدالعال",
        "total": 197,
        "percentage": 0.788
      }
    ],
    "grades": {
      "امتياز": 11,
      "جيد جدا": 18,
      "جيد": 3,
      "مقبول": 0,
      "راسب": 0
    },
    "total": 32
  },
  "إسراء أحمد حمدان": {
    "name": "إسراء أحمد حمدان",
    "students": [
      {
        "id": 1,
        "name": "نورهان محمود عويس محمود",
        "sheet": "إسراء أحمد حمدان",
        "total": 240.5,
        "percentage": 0.962
      },
      {
        "id": 2,
        "name": "فاطمة أحمد فتحي محمد",
        "sheet": "إسراء أحمد حمدان",
        "total": 237.5,
        "percentage": 0.95
      },
      {
        "id": 3,
        "name": "رحمة إسماعيل حجاج إسماعيل",
        "sheet": "إسراء أحمد حمدان",
        "total": 235,
        "percentage": 0.94
      },
      {
        "id": 4,
        "name": "ريتاج عصام عبدالحميد جابر",
        "sheet": "إسراء أحمد حمدان",
        "total": 232,
        "percentage": 0.928
      },
      {
        "id": 5,
        "name": "مازن كامل رجب جابر",
        "sheet": "إسراء أحمد حمدان",
        "total": 230,
        "percentage": 0.92
      },
      {
        "id": 6,
        "name": "حمزة عمر حسين سليمان",
        "sheet": "إسراء أحمد حمدان",
        "total": 229.5,
        "percentage": 0.918
      },
      {
        "id": 7,
        "name": "أحمد رمضان سيد قرنى",
        "sheet": "إسراء أحمد حمدان",
        "total": 229,
        "percentage": 0.916
      },
      {
        "id": 8,
        "name": "ضحى مصطفى سعدالدين",
        "sheet": "إسراء أحمد حمدان",
        "total": 229,
        "percentage": 0.916
      },
      {
        "id": 12,
        "name": "سما سلامة عبدالفتاح",
        "sheet": "إسراء أحمد حمدان",
        "total": 225,
        "percentage": 0.9
      },
      {
        "id": 9,
        "name": "شهاب أشرف خميس عبدالجواد",
        "sheet": "إسراء أحمد حمدان",
        "total": 223.5,
        "percentage": 0.894
      },
      {
        "id": 10,
        "name": "عبدالله مصطفى سعد علي",
        "sheet": "إسراء أحمد حمدان",
        "total": 223.5,
        "percentage": 0.894
      },
      {
        "id": 11,
        "name": "أنس محمد صلاح علي",
        "sheet": "إسراء أحمد حمدان",
        "total": 222,
        "percentage": 0.888
      }
    ],
    "grades": {
      "امتياز": 9,
      "جيد جدا": 3,
      "جيد": 0,
      "مقبول": 0,
      "راسب": 0
    },
    "total": 12
  },
  "زينب محمد العريان": {
    "name": "زينب محمد العريان",
    "students": [
      {
        "id": 1,
        "name": "شهد سيد رضوان عبد الحميد",
        "sheet": "زينب محمد العريان",
        "total": 240.25,
        "percentage": 0.961
      },
      {
        "id": 2,
        "name": "رودينا محمد محمود سيد",
        "sheet": "زينب محمد العريان",
        "total": 240,
        "percentage": 0.96
      },
      {
        "id": 3,
        "name": "ياسمين صادق سيد صادق",
        "sheet": "زينب محمد العريان",
        "total": 235.75,
        "percentage": 0.943
      },
      {
        "id": 4,
        "name": "ايمان شعبان احمد محمد",
        "sheet": "زينب محمد العريان",
        "total": 233.5,
        "percentage": 0.934
      },
      {
        "id": 5,
        "name": "رضا عرفة عطية ميزار",
        "sheet": "زينب محمد العريان",
        "total": 229.5,
        "percentage": 0.918
      },
      {
        "id": 6,
        "name": "بسملة وليد عبدالفتاح عبدالحميد",
        "sheet": "زينب محمد العريان",
        "total": 226.5,
        "percentage": 0.906
      },
      {
        "id": 7,
        "name": "عزه محمد حامد بيومى",
        "sheet": "زينب محمد العريان",
        "total": 226.5,
        "percentage": 0.906
      },
      {
        "id": 8,
        "name": "عبد الرحمن محمود حمدى طه",
        "sheet": "زينب محمد العريان",
        "total": 221,
        "percentage": 0.884
      },
      {
        "id": 9,
        "name": "معاذ محمود حمدى طه",
        "sheet": "زينب محمد العريان",
        "total": 221,
        "percentage": 0.884
      },
      {
        "id": 10,
        "name": "سما محمود سيد عباس",
        "sheet": "زينب محمد العريان",
        "total": 219.5,
        "percentage": 0.878
      },
      {
        "id": 11,
        "name": "ندى جبر عبدالعليم سيد",
        "sheet": "زينب محمد العريان",
        "total": 219.5,
        "percentage": 0.878
      },
      {
        "id": 12,
        "name": "عمر محمد محمود سيد",
        "sheet": "زينب محمد العريان",
        "total": 218,
        "percentage": 0.872
      },
      {
        "id": 13,
        "name": "حنين احمد عيد سلطان",
        "sheet": "زينب محمد العريان",
        "total": 215.5,
        "percentage": 0.862
      },
      {
        "id": 14,
        "name": "ندى احمد على عبد العزيز",
        "sheet": "زينب محمد العريان",
        "total": 214.5,
        "percentage": 0.858
      }
    ],
    "grades": {
      "امتياز": 7,
      "جيد جدا": 7,
      "جيد": 0,
      "مقبول": 0,
      "راسب": 0
    },
    "total": 14
  },
  "بسمة شحاتة شعبان": {
    "name": "بسمة شحاتة شعبان",
    "students": [
      {
        "id": 1,
        "name": "يوسف محمود خليل إبراهيم",
        "sheet": "بسمة شحاتة شعبان",
        "total": 240,
        "percentage": 0.96
      },
      {
        "id": 2,
        "name": "رحيق علي سليمان علي",
        "sheet": "بسمة شحاتة شعبان",
        "total": 239.25,
        "percentage": 0.957
      },
      {
        "id": 3,
        "name": "أحمد محمد حمدي محمد",
        "sheet": "بسمة شحاتة شعبان",
        "total": 238.5,
        "percentage": 0.954
      },
      {
        "id": 4,
        "name": "يارا خالد إسماعيل حسن",
        "sheet": "بسمة شحاتة شعبان",
        "total": 237.75,
        "percentage": 0.951
      },
      {
        "id": 5,
        "name": "ريم وليد سيد خالد",
        "sheet": "بسمة شحاتة شعبان",
        "total": 237.5,
        "percentage": 0.95
      },
      {
        "id": 6,
        "name": "جيداء حمادة سلامة سيد",
        "sheet": "بسمة شحاتة شعبان",
        "total": 233.25,
        "percentage": 0.933
      },
      {
        "id": 7,
        "name": "ريتال أحمد رمضان صديق",
        "sheet": "بسمة شحاتة شعبان",
        "total": 233.25,
        "percentage": 0.933
      },
      {
        "id": 8,
        "name": "جنا شعبان إسماعيل سيد",
        "sheet": "بسمة شحاتة شعبان",
        "total": 231.25,
        "percentage": 0.925
      },
      {
        "id": 9,
        "name": "زياد محمود عبدالفتاح عبدالعزيز",
        "sheet": "بسمة شحاتة شعبان",
        "total": 231.25,
        "percentage": 0.925
      },
      {
        "id": 10,
        "name": "حبيبة أحمد فتحي محمد",
        "sheet": "بسمة شحاتة شعبان",
        "total": 226.25,
        "percentage": 0.905
      },
      {
        "id": 11,
        "name": "رنا صادق جابر صادق",
        "sheet": "بسمة شحاتة شعبان",
        "total": 224,
        "percentage": 0.896
      },
      {
        "id": 12,
        "name": "رودينا محمود مصطفى حسين",
        "sheet": "بسمة شحاتة شعبان",
        "total": 223,
        "percentage": 0.892
      },
      {
        "id": 13,
        "name": "رؤى أحمد رمضان صديق",
        "sheet": "بسمة شحاتة شعبان",
        "total": 222.5,
        "percentage": 0.89
      },
      {
        "id": 14,
        "name": "روضة مصطفى قرني محمد",
        "sheet": "بسمة شحاتة شعبان",
        "total": 221.5,
        "percentage": 0.886
      },
      {
        "id": 15,
        "name": "فريجة أحمد فرج عبدالصالحين",
        "sheet": "بسمة شحاتة شعبان",
        "total": 216,
        "percentage": 0.864
      },
      {
        "id": 16,
        "name": "رودينا قرني عبدالرحمن محمد",
        "sheet": "بسمة شحاتة شعبان",
        "total": 215.5,
        "percentage": 0.862
      }
    ],
    "grades": {
      "امتياز": 10,
      "جيد جدا": 6,
      "جيد": 0,
      "مقبول": 0,
      "راسب": 0
    },
    "total": 16
  },
  "حجاج محمد عبدالتواب": {
    "name": "حجاج محمد عبدالتواب",
    "students": [
      {
        "id": 1,
        "name": "محمد أحمد رمضان عبدالتواب",
        "sheet": "حجاج محمد عبدالتواب",
        "total": 239.75,
        "percentage": 0.959
      },
      {
        "id": 2,
        "name": "عبدالرحمن سيد قرني سليمان",
        "sheet": "حجاج محمد عبدالتواب",
        "total": 233.5,
        "percentage": 0.934
      },
      {
        "id": 3,
        "name": "محمود ربيع أحمد عبدالعليم",
        "sheet": "حجاج محمد عبدالتواب",
        "total": 227,
        "percentage": 0.908
      },
      {
        "id": 4,
        "name": "حامد سيد حامد سيد",
        "sheet": "حجاج محمد عبدالتواب",
        "total": 224.5,
        "percentage": 0.898
      },
      {
        "id": 5,
        "name": "فارس صلاح رمضان محمد",
        "sheet": "حجاج محمد عبدالتواب",
        "total": 221.5,
        "percentage": 0.886
      },
      {
        "id": 6,
        "name": "عبدالرحمن وجيه برباش جابر",
        "sheet": "حجاج محمد عبدالتواب",
        "total": 216.5,
        "percentage": 0.866
      },
      {
        "id": 7,
        "name": "شهاب أحمد رجب كامل",
        "sheet": "حجاج محمد عبدالتواب",
        "total": 211.5,
        "percentage": 0.846
      }
    ],
    "grades": {
      "امتياز": 3,
      "جيد جدا": 4,
      "جيد": 0,
      "مقبول": 0,
      "راسب": 0
    },
    "total": 7
  },
  "حبيبة ربيع مفتاح": {
    "name": "حبيبة ربيع مفتاح",
    "students": [
      {
        "id": 1,
        "name": "حبيبة سيد محمود محمد",
        "sheet": "حبيبة ربيع مفتاح",
        "total": 239.75,
        "percentage": 0.959
      },
      {
        "id": 2,
        "name": "حنين عاطف أحمد علي",
        "sheet": "حبيبة ربيع مفتاح",
        "total": 237.25,
        "percentage": 0.949
      },
      {
        "id": 3,
        "name": "عبدالرحمن شعبان عويس عبدالله",
        "sheet": "حبيبة ربيع مفتاح",
        "total": 236.75,
        "percentage": 0.947
      },
      {
        "id": 4,
        "name": "مى أحمد فتحي محمد",
        "sheet": "حبيبة ربيع مفتاح",
        "total": 233,
        "percentage": 0.932
      },
      {
        "id": 5,
        "name": "هدير علي شحاتة حسن",
        "sheet": "حبيبة ربيع مفتاح",
        "total": 232.5,
        "percentage": 0.93
      },
      {
        "id": 6,
        "name": "إسراء محمود عبدالفضيل عبدالحميد",
        "sheet": "حبيبة ربيع مفتاح",
        "total": 232,
        "percentage": 0.928
      },
      {
        "id": 7,
        "name": "أسيل عصام عبدالحميد صابر",
        "sheet": "حبيبة ربيع مفتاح",
        "total": 229.5,
        "percentage": 0.918
      },
      {
        "id": 8,
        "name": "ليليان محمود محمد عطية",
        "sheet": "حبيبة ربيع مفتاح",
        "total": 228,
        "percentage": 0.912
      },
      {
        "id": 9,
        "name": "حنين أحمد رمضان شعبان",
        "sheet": "حبيبة ربيع مفتاح",
        "total": 227.5,
        "percentage": 0.91
      },
      {
        "id": 10,
        "name": "سمر شريف حسين علي",
        "sheet": "حبيبة ربيع مفتاح",
        "total": 227.25,
        "percentage": 0.909
      },
      {
        "id": 11,
        "name": "رضوى أكرم شعبان سيد",
        "sheet": "حبيبة ربيع مفتاح",
        "total": 226.25,
        "percentage": 0.905
      },
      {
        "id": 12,
        "name": "روميساء عباس أحمد عباس",
        "sheet": "حبيبة ربيع مفتاح",
        "total": 219.75,
        "percentage": 0.879
      },
      {
        "id": 13,
        "name": "مريم أحمد جابر إمام",
        "sheet": "حبيبة ربيع مفتاح",
        "total": 214,
        "percentage": 0.856
      },
      {
        "id": 14,
        "name": "أروى إبراهيم عبدالسلام حسن",
        "sheet": "حبيبة ربيع مفتاح",
        "total": 211,
        "percentage": 0.844
      },
      {
        "id": 15,
        "name": "مروة مصطفى علي عبدالعزيز",
        "sheet": "حبيبة ربيع مفتاح",
        "total": 207.75,
        "percentage": 0.831
      },
      {
        "id": 16,
        "name": "رؤيا محمد أحمد عبدالعزيز",
        "sheet": "حبيبة ربيع مفتاح",
        "total": 207,
        "percentage": 0.828
      }
    ],
    "grades": {
      "امتياز": 11,
      "جيد جدا": 5,
      "جيد": 0,
      "مقبول": 0,
      "راسب": 0
    },
    "total": 16
  },
  "مروة حسن قرني": {
    "name": "مروة حسن قرني",
    "students": [
      {
        "id": 1,
        "name": "خديجة عبدالناصر عبدالله أحمد",
        "sheet": "مروة حسن قرني",
        "total": 238.75,
        "percentage": 0.955
      },
      {
        "id": 2,
        "name": "حبيبة علي سليمان علي",
        "sheet": "مروة حسن قرني",
        "total": 233,
        "percentage": 0.932
      },
      {
        "id": 3,
        "name": "حبيبة تامر رمضان عويس",
        "sheet": "مروة حسن قرني",
        "total": 221.5,
        "percentage": 0.886
      },
      {
        "id": 4,
        "name": "منال مصطفى جاب الله حسين",
        "sheet": "مروة حسن قرني",
        "total": 220,
        "percentage": 0.88
      },
      {
        "id": 5,
        "name": "غادة أحمد رجب عويس",
        "sheet": "مروة حسن قرني",
        "total": 218.5,
        "percentage": 0.874
      },
      {
        "id": 6,
        "name": "شهاب الدين محمد مفتاح عبدالجيد",
        "sheet": "مروة حسن قرني",
        "total": 217,
        "percentage": 0.868
      },
      {
        "id": 7,
        "name": "روفيدة عبدالحليم قرني هبار",
        "sheet": "مروة حسن قرني",
        "total": 213,
        "percentage": 0.852
      },
      {
        "id": 8,
        "name": "آيه سيد حافظ سيد",
        "sheet": "مروة حسن قرني",
        "total": 212.5,
        "percentage": 0.85
      },
      {
        "id": 9,
        "name": "ضحى حمادة عبدالفتاح حامد",
        "sheet": "مروة حسن قرني",
        "total": 212.5,
        "percentage": 0.85
      },
      {
        "id": 10,
        "name": "شهد محمود جبر شحاتة",
        "sheet": "مروة حسن قرني",
        "total": 202,
        "percentage": 0.808
      },
      {
        "id": 11,
        "name": "ملك محمد فضالي عويس",
        "sheet": "مروة حسن قرني",
        "total": 196,
        "percentage": 0.784
      },
      {
        "id": 12,
        "name": "فرحة عماد علي شاكر",
        "sheet": "مروة حسن قرني",
        "total": 188.5,
        "percentage": 0.754
      }
    ],
    "grades": {
      "امتياز": 2,
      "جيد جدا": 8,
      "جيد": 2,
      "مقبول": 0,
      "راسب": 0
    },
    "total": 12
  },
  "منة أحمد خليل": {
    "name": "منة أحمد خليل",
    "students": [
      {
        "id": 1,
        "name": "خديجة أحمد علي قرني",
        "sheet": "منة أحمد خليل",
        "total": 238.5,
        "percentage": 0.954
      },
      {
        "id": 2,
        "name": "حفصة عبدالرحمن فؤاد سلطان",
        "sheet": "منة أحمد خليل",
        "total": 233.5,
        "percentage": 0.934
      },
      {
        "id": 3,
        "name": "زياد عبدالنبي شعبان شحاتة",
        "sheet": "منة أحمد خليل",
        "total": 232.5,
        "percentage": 0.93
      },
      {
        "id": 4,
        "name": "أشرقت أحمد رشاد حسن",
        "sheet": "منة أحمد خليل",
        "total": 231,
        "percentage": 0.924
      },
      {
        "id": 5,
        "name": "جودي محمد صالح خالد",
        "sheet": "منة أحمد خليل",
        "total": 230.5,
        "percentage": 0.922
      },
      {
        "id": 6,
        "name": "سيف محمد فتحي موسى",
        "sheet": "منة أحمد خليل",
        "total": 230,
        "percentage": 0.92
      },
      {
        "id": 7,
        "name": "عدي محسن مختار كامل",
        "sheet": "منة أحمد خليل",
        "total": 228,
        "percentage": 0.912
      },
      {
        "id": 8,
        "name": "رضا عزت شحاتة علي",
        "sheet": "منة أحمد خليل",
        "total": 224,
        "percentage": 0.896
      },
      {
        "id": 9,
        "name": "محمد حمادة شحاتة عبدالجواد",
        "sheet": "منة أحمد خليل",
        "total": 223,
        "percentage": 0.892
      },
      {
        "id": 10,
        "name": "حنين محمد مفتاح محمد",
        "sheet": "منة أحمد خليل",
        "total": 220,
        "percentage": 0.88
      },
      {
        "id": 11,
        "name": "يوسف أحمد جابر إمام",
        "sheet": "منة أحمد خليل",
        "total": 220,
        "percentage": 0.88
      },
      {
        "id": 12,
        "name": "لمياء أحمد يوسف إبراهيم",
        "sheet": "منة أحمد خليل",
        "total": 219.5,
        "percentage": 0.878
      },
      {
        "id": 13,
        "name": "محمد وجيه عباس أحمد",
        "sheet": "منة أحمد خليل",
        "total": 219,
        "percentage": 0.876
      },
      {
        "id": 14,
        "name": "مريم أحمد محمد محمد",
        "sheet": "منة أحمد خليل",
        "total": 219,
        "percentage": 0.876
      },
      {
        "id": 15,
        "name": "آسر أحمد رمضان عبدالرحمن",
        "sheet": "منة أحمد خليل",
        "total": 218,
        "percentage": 0.872
      },
      {
        "id": 16,
        "name": "هاجر محمد سيد عطية",
        "sheet": "منة أحمد خليل",
        "total": 218,
        "percentage": 0.872
      },
      {
        "id": 17,
        "name": "معتز عبدالنبي شعبان شحاتة",
        "sheet": "منة أحمد خليل",
        "total": 211.5,
        "percentage": 0.846
      }
    ],
    "grades": {
      "امتياز": 7,
      "جيد جدا": 10,
      "جيد": 0,
      "مقبول": 0,
      "راسب": 0
    },
    "total": 17
  },
  "فوزية أشرف عوض": {
    "name": "فوزية أشرف عوض",
    "students": [
      {
        "id": 1,
        "name": "أسماء محمد محمد أحمد",
        "sheet": "فوزية أشرف عوض",
        "total": 238,
        "percentage": 0.952
      },
      {
        "id": 2,
        "name": "إلهام محمد محمود جاد",
        "sheet": "فوزية أشرف عوض",
        "total": 236,
        "percentage": 0.944
      },
      {
        "id": 3,
        "name": "منال شوقي أحمد إسماعيل",
        "sheet": "فوزية أشرف عوض",
        "total": 236,
        "percentage": 0.944
      },
      {
        "id": 4,
        "name": "نورة سيد حفني حسن",
        "sheet": "فوزية أشرف عوض",
        "total": 234.5,
        "percentage": 0.938
      },
      {
        "id": 5,
        "name": "أمل على",
        "sheet": "فوزية أشرف عوض",
        "total": 232,
        "percentage": 0.928
      },
      {
        "id": 6,
        "name": "ناهد عبدالستار حامد سيد",
        "sheet": "فوزية أشرف عوض",
        "total": 228,
        "percentage": 0.912
      },
      {
        "id": 7,
        "name": "رزقة علي عبدالجليل أسعد",
        "sheet": "فوزية أشرف عوض",
        "total": 227.5,
        "percentage": 0.91
      },
      {
        "id": 8,
        "name": "أطاطة صلاح محمود عبدالجواد",
        "sheet": "فوزية أشرف عوض",
        "total": 227,
        "percentage": 0.908
      },
      {
        "id": 9,
        "name": "صابرة أحمد محمد محمد",
        "sheet": "فوزية أشرف عوض",
        "total": 220,
        "percentage": 0.88
      },
      {
        "id": 10,
        "name": "رجاء أبوالخير عيسى عبدالجواد",
        "sheet": "فوزية أشرف عوض",
        "total": 206,
        "percentage": 0.824
      },
      {
        "id": 11,
        "name": "عزة فتحي عبدالتواب عوض",
        "sheet": "فوزية أشرف عوض",
        "total": 205,
        "percentage": 0.82
      },
      {
        "id": 16,
        "name": "زينب محمد عبدالفتاح محمد",
        "sheet": "فوزية أشرف عوض",
        "total": 118,
        "percentage": 0.472
      },
      {
        "id": 15,
        "name": "أسماء ربيع ذكى",
        "sheet": "فوزية أشرف عوض",
        "total": 115.5,
        "percentage": 0.462
      },
      {
        "id": 12,
        "name": "هالة محمد عبدالحميد طه",
        "sheet": "فوزية أشرف عوض",
        "total": 115,
        "percentage": 0.46
      },
      {
        "id": 14,
        "name": "دينا رأفت عيسى محمد",
        "sheet": "فوزية أشرف عوض",
        "total": 114.5,
        "percentage": 0.458
      },
      {
        "id": 17,
        "name": "شروق مصطفى شعبان أحمد",
        "sheet": "فوزية أشرف عوض",
        "total": 111,
        "percentage": 0.444
      },
      {
        "id": 13,
        "name": "عزة حجاج عبدالمنعم محمد",
        "sheet": "فوزية أشرف عوض",
        "total": 109.5,
        "percentage": 0.438
      }
    ],
    "grades": {
      "امتياز": 8,
      "جيد جدا": 3,
      "جيد": 0,
      "مقبول": 0,
      "راسب": 6
    },
    "total": 17
  },
  "فاطمة قرني سيد": {
    "name": "فاطمة قرني سيد",
    "students": [
      {
        "id": 1,
        "name": "رحمة عصام عبدالعظيم معوض",
        "sheet": "فاطمة قرني سيد",
        "total": 238,
        "percentage": 0.952
      },
      {
        "id": 2,
        "name": "منة حسين فضالي عويس",
        "sheet": "فاطمة قرني سيد",
        "total": 237,
        "percentage": 0.948
      },
      {
        "id": 3,
        "name": "حبيبة أحمد سيد حفني",
        "sheet": "فاطمة قرني سيد",
        "total": 233.5,
        "percentage": 0.934
      },
      {
        "id": 4,
        "name": "ملك سلامة عبدالوهاب عبدالحميد",
        "sheet": "فاطمة قرني سيد",
        "total": 231.5,
        "percentage": 0.926
      },
      {
        "id": 5,
        "name": "إيمان شوقي أحمد محمد",
        "sheet": "فاطمة قرني سيد",
        "total": 231.25,
        "percentage": 0.925
      },
      {
        "id": 6,
        "name": "فاطمة شوقي أحمد محمد",
        "sheet": "فاطمة قرني سيد",
        "total": 229.5,
        "percentage": 0.918
      },
      {
        "id": 7,
        "name": "رنا علاء محمد قرني",
        "sheet": "فاطمة قرني سيد",
        "total": 226.5,
        "percentage": 0.906
      },
      {
        "id": 8,
        "name": "سلسبيل محمد عبدالعزيز محمد",
        "sheet": "فاطمة قرني سيد",
        "total": 223,
        "percentage": 0.892
      },
      {
        "id": 9,
        "name": "رضوى سعد عبدالعال أحمد",
        "sheet": "فاطمة قرني سيد",
        "total": 219.5,
        "percentage": 0.878
      },
      {
        "id": 10,
        "name": "منة عيد عبدالوهاب عبدالحميد",
        "sheet": "فاطمة قرني سيد",
        "total": 214.5,
        "percentage": 0.858
      },
      {
        "id": 11,
        "name": "إسراء صابر عبدالفتاح إبراهيم",
        "sheet": "فاطمة قرني سيد",
        "total": 136.75,
        "percentage": 0.547
      }
    ],
    "grades": {
      "امتياز": 7,
      "جيد جدا": 3,
      "جيد": 0,
      "مقبول": 1,
      "راسب": 0
    },
    "total": 11
  },
  "آلاء جمال رمضان": {
    "name": "آلاء جمال رمضان",
    "students": [
      {
        "id": 1,
        "name": "نجلاء عبدالفتاح علي عبدالماجد",
        "sheet": "آلاء جمال رمضان",
        "total": 236.5,
        "percentage": 0.946
      },
      {
        "id": 2,
        "name": "نجلاء جابر صادق محمد",
        "sheet": "آلاء جمال رمضان",
        "total": 235,
        "percentage": 0.94
      },
      {
        "id": 3,
        "name": "نعمة فضالي عويس عثمان",
        "sheet": "آلاء جمال رمضان",
        "total": 233.5,
        "percentage": 0.934
      },
      {
        "id": 4,
        "name": "آية أحمد محمود عوض الله",
        "sheet": "آلاء جمال رمضان",
        "total": 229,
        "percentage": 0.916
      },
      {
        "id": 5,
        "name": "إيمان محمد محمد أحمد",
        "sheet": "آلاء جمال رمضان",
        "total": 228.5,
        "percentage": 0.914
      },
      {
        "id": 6,
        "name": "إيمان صلاح عيسى عبدالجواد",
        "sheet": "آلاء جمال رمضان",
        "total": 227.5,
        "percentage": 0.91
      },
      {
        "id": 7,
        "name": "سحر محمد عويس مصطفى",
        "sheet": "آلاء جمال رمضان",
        "total": 227.5,
        "percentage": 0.91
      },
      {
        "id": 8,
        "name": "حبوبة حمدي إدريس علي",
        "sheet": "آلاء جمال رمضان",
        "total": 227,
        "percentage": 0.908
      },
      {
        "id": 9,
        "name": "سامية رمضان سيد سيد",
        "sheet": "آلاء جمال رمضان",
        "total": 223,
        "percentage": 0.892
      },
      {
        "id": 10,
        "name": "فاتن شحاتة عبدالوهاب مرزوق",
        "sheet": "آلاء جمال رمضان",
        "total": 220,
        "percentage": 0.88
      },
      {
        "id": 11,
        "name": "عائشة جابر أبو المكارم عبدالعزيز",
        "sheet": "آلاء جمال رمضان",
        "total": 219.5,
        "percentage": 0.878
      },
      {
        "id": 12,
        "name": "أحلام عبدالعال علي سيد",
        "sheet": "آلاء جمال رمضان",
        "total": 217,
        "percentage": 0.868
      },
      {
        "id": 13,
        "name": "سلوى مفتاح محمد فرغلي",
        "sheet": "آلاء جمال رمضان",
        "total": 198,
        "percentage": 0.792
      },
      {
        "id": 14,
        "name": "فوزية سيد حفني حسن",
        "sheet": "آلاء جمال رمضان",
        "total": 115.5,
        "percentage": 0.462
      },
      {
        "id": 15,
        "name": "أميرة أبوالخير عبدالعظيم محمد",
        "sheet": "آلاء جمال رمضان",
        "total": 112.5,
        "percentage": 0.45
      }
    ],
    "grades": {
      "امتياز": 8,
      "جيد جدا": 4,
      "جيد": 1,
      "مقبول": 0,
      "راسب": 2
    },
    "total": 15
  },
  "صفاء رمضان عبدالوهاب": {
    "name": "صفاء رمضان عبدالوهاب",
    "students": [
      {
        "id": 1,
        "name": "مايا هاني أحمد إمام",
        "sheet": "صفاء رمضان عبدالوهاب",
        "total": 235,
        "percentage": 0.94
      },
      {
        "id": 2,
        "name": "حمزة أحمد حمدي طه",
        "sheet": "صفاء رمضان عبدالوهاب",
        "total": 228,
        "percentage": 0.912
      },
      {
        "id": 3,
        "name": "ألاء محمد عويس جنيدي",
        "sheet": "صفاء رمضان عبدالوهاب",
        "total": 225.5,
        "percentage": 0.902
      },
      {
        "id": 4,
        "name": "سما محمد حسن علي",
        "sheet": "صفاء رمضان عبدالوهاب",
        "total": 225.5,
        "percentage": 0.902
      },
      {
        "id": 5,
        "name": "ألاء حسين عبدالواحد محمد",
        "sheet": "صفاء رمضان عبدالوهاب",
        "total": 224.5,
        "percentage": 0.898
      },
      {
        "id": 6,
        "name": "عبدالرحمن ياسين سيد ياسين",
        "sheet": "صفاء رمضان عبدالوهاب",
        "total": 224,
        "percentage": 0.896
      },
      {
        "id": 7,
        "name": "محمد فتحي جابر إمام",
        "sheet": "صفاء رمضان عبدالوهاب",
        "total": 223.5,
        "percentage": 0.894
      },
      {
        "id": 8,
        "name": "اسراء احمد خليل ابراهيم",
        "sheet": "صفاء رمضان عبدالوهاب",
        "total": 223,
        "percentage": 0.892
      },
      {
        "id": 9,
        "name": "مريم عبدالوهاب شعبان عبدالوهاب",
        "sheet": "صفاء رمضان عبدالوهاب",
        "total": 222,
        "percentage": 0.888
      },
      {
        "id": 10,
        "name": "هنا سيد سعيد أحمد",
        "sheet": "صفاء رمضان عبدالوهاب",
        "total": 221,
        "percentage": 0.884
      },
      {
        "id": 11,
        "name": "ياسين أحمد عبدالعليم سيد",
        "sheet": "صفاء رمضان عبدالوهاب",
        "total": 221,
        "percentage": 0.884
      },
      {
        "id": 22,
        "name": "مودة أحمد عبدالعليم سيد",
        "sheet": "صفاء رمضان عبدالوهاب",
        "total": 219.5,
        "percentage": 0.878
      },
      {
        "id": 12,
        "name": "رودينا ياسين سيد ياسين",
        "sheet": "صفاء رمضان عبدالوهاب",
        "total": 219,
        "percentage": 0.876
      },
      {
        "id": 13,
        "name": "جنا محمد عمر عبدالمنعم",
        "sheet": "صفاء رمضان عبدالوهاب",
        "total": 217,
        "percentage": 0.868
      },
      {
        "id": 14,
        "name": "مصطفى محمد طه محمد",
        "sheet": "صفاء رمضان عبدالوهاب",
        "total": 217,
        "percentage": 0.868
      },
      {
        "id": 15,
        "name": "عباس حمدي فتحي سعيد",
        "sheet": "صفاء رمضان عبدالوهاب",
        "total": 216,
        "percentage": 0.864
      },
      {
        "id": 16,
        "name": "محمد سيد رمزي أحمد",
        "sheet": "صفاء رمضان عبدالوهاب",
        "total": 209.5,
        "percentage": 0.838
      },
      {
        "id": 17,
        "name": "مروان محمود رضوان عبدالحميد",
        "sheet": "صفاء رمضان عبدالوهاب",
        "total": 200.5,
        "percentage": 0.802
      },
      {
        "id": 18,
        "name": "ريان عمر إسماعيل سيد",
        "sheet": "صفاء رمضان عبدالوهاب",
        "total": 141.5,
        "percentage": 0.566
      },
      {
        "id": 19,
        "name": "آدم عمر إسماعيل سيد",
        "sheet": "صفاء رمضان عبدالوهاب",
        "total": 140.5,
        "percentage": 0.562
      },
      {
        "id": 20,
        "name": "مروان رجب عثمان قطب",
        "sheet": "صفاء رمضان عبدالوهاب",
        "total": 125,
        "percentage": 0.5
      },
      {
        "id": 21,
        "name": "وعد رجب عثمان قطب",
        "sheet": "صفاء رمضان عبدالوهاب",
        "total": 122,
        "percentage": 0.488
      }
    ],
    "grades": {
      "امتياز": 4,
      "جيد جدا": 14,
      "جيد": 0,
      "مقبول": 3,
      "راسب": 1
    },
    "total": 22
  },
  "علياء رجب محمد": {
    "name": "علياء رجب محمد",
    "students": [
      {
        "id": 1,
        "name": "حور محمود علي عبدالعزيز",
        "sheet": "علياء رجب محمد",
        "total": 235,
        "percentage": 0.94
      },
      {
        "id": 2,
        "name": "حياة حجازي سيد ياسين",
        "sheet": "علياء رجب محمد",
        "total": 234,
        "percentage": 0.936
      },
      {
        "id": 3,
        "name": "فرحة محمود سيد  ياسين",
        "sheet": "علياء رجب محمد",
        "total": 232,
        "percentage": 0.928
      },
      {
        "id": 4,
        "name": "أبرار محمود سيد ياسين",
        "sheet": "علياء رجب محمد",
        "total": 231,
        "percentage": 0.924
      },
      {
        "id": 5,
        "name": "معاذ حسن فتحي أحمد",
        "sheet": "علياء رجب محمد",
        "total": 230,
        "percentage": 0.92
      },
      {
        "id": 6,
        "name": "مريم عادل إمام عبدالرحمن",
        "sheet": "علياء رجب محمد",
        "total": 229.5,
        "percentage": 0.918
      },
      {
        "id": 7,
        "name": "سندس أحمد سيد عطية",
        "sheet": "علياء رجب محمد",
        "total": 229,
        "percentage": 0.916
      },
      {
        "id": 8,
        "name": "جنة رجب حجازي عبدالحميد",
        "sheet": "علياء رجب محمد",
        "total": 228,
        "percentage": 0.912
      },
      {
        "id": 9,
        "name": "حور علاء إمام عبدالرحمن",
        "sheet": "علياء رجب محمد",
        "total": 227.5,
        "percentage": 0.91
      },
      {
        "id": 10,
        "name": "أسمهان حمادة عبدالفتاح حامد",
        "sheet": "علياء رجب محمد",
        "total": 227,
        "percentage": 0.908
      },
      {
        "id": 11,
        "name": "بسنت عبدالسلام عبدالعزيز إمام",
        "sheet": "علياء رجب محمد",
        "total": 227,
        "percentage": 0.908
      },
      {
        "id": 12,
        "name": "بشرى حسين ربيع حسين",
        "sheet": "علياء رجب محمد",
        "total": 227,
        "percentage": 0.908
      },
      {
        "id": 13,
        "name": "مكة أحمد محمد إسماعيل",
        "sheet": "علياء رجب محمد",
        "total": 225.5,
        "percentage": 0.902
      },
      {
        "id": 14,
        "name": "روضة أحمد حسن محمد",
        "sheet": "علياء رجب محمد",
        "total": 224.5,
        "percentage": 0.898
      },
      {
        "id": 15,
        "name": "منسة شحاتة أحمد نوح",
        "sheet": "علياء رجب محمد",
        "total": 224,
        "percentage": 0.896
      },
      {
        "id": 16,
        "name": "ريتياج محمد عبدالله عبدالعظيم",
        "sheet": "علياء رجب محمد",
        "total": 223,
        "percentage": 0.892
      },
      {
        "id": 17,
        "name": "بسملة أنور سيد أنور",
        "sheet": "علياء رجب محمد",
        "total": 221,
        "percentage": 0.884
      },
      {
        "id": 18,
        "name": "آدم أحمد علي سعد",
        "sheet": "علياء رجب محمد",
        "total": 220.5,
        "percentage": 0.882
      },
      {
        "id": 19,
        "name": "آدم سيد محمد سيد",
        "sheet": "علياء رجب محمد",
        "total": 214,
        "percentage": 0.856
      },
      {
        "id": 20,
        "name": "مالك أحمد سيد ياسين",
        "sheet": "علياء رجب محمد",
        "total": 211,
        "percentage": 0.844
      },
      {
        "id": 21,
        "name": "آدم أحمد سيد ياسين",
        "sheet": "علياء رجب محمد",
        "total": 208.5,
        "percentage": 0.834
      },
      {
        "id": 22,
        "name": "مصطفى ربيع شعبان سيد",
        "sheet": "علياء رجب محمد",
        "total": 204,
        "percentage": 0.816
      },
      {
        "id": 23,
        "name": "أحمد سيد محمد سيد",
        "sheet": "علياء رجب محمد",
        "total": 197,
        "percentage": 0.788
      }
    ],
    "grades": {
      "امتياز": 13,
      "جيد جدا": 9,
      "جيد": 1,
      "مقبول": 0,
      "راسب": 0
    },
    "total": 23
  },
  "عبدالرحمن محمد حسن": {
    "name": "عبدالرحمن محمد حسن",
    "students": [
      {
        "id": 1,
        "name": "مصطفى عبدالسلام سيد عبدالعليم",
        "sheet": "عبدالرحمن محمد حسن",
        "total": 234,
        "percentage": 0.936
      },
      {
        "id": 2,
        "name": "معاذ علي سليمان علي",
        "sheet": "عبدالرحمن محمد حسن",
        "total": 230,
        "percentage": 0.92
      },
      {
        "id": 3,
        "name": "أحمد محمد حسين سلامة",
        "sheet": "عبدالرحمن محمد حسن",
        "total": 227,
        "percentage": 0.908
      },
      {
        "id": 4,
        "name": "أحمد نبيل فتحي عبدالسلام",
        "sheet": "عبدالرحمن محمد حسن",
        "total": 224.75,
        "percentage": 0.899
      },
      {
        "id": 5,
        "name": "مصطفى وائل أحمد علي",
        "sheet": "عبدالرحمن محمد حسن",
        "total": 223.5,
        "percentage": 0.894
      },
      {
        "id": 6,
        "name": "يوسف محمد يحيي محمود",
        "sheet": "عبدالرحمن محمد حسن",
        "total": 223.5,
        "percentage": 0.894
      },
      {
        "id": 7,
        "name": "زياد سيد محمد سيد",
        "sheet": "عبدالرحمن محمد حسن",
        "total": 219,
        "percentage": 0.876
      },
      {
        "id": 8,
        "name": "عبدالرحمن عبدالوهاب شعبان",
        "sheet": "عبدالرحمن محمد حسن",
        "total": 215.5,
        "percentage": 0.862
      },
      {
        "id": 9,
        "name": "مصطفى علاء جابر سيد",
        "sheet": "عبدالرحمن محمد حسن",
        "total": 213.5,
        "percentage": 0.854
      },
      {
        "id": 10,
        "name": "أحمد هاني ممدوح حسن",
        "sheet": "عبدالرحمن محمد حسن",
        "total": 211.5,
        "percentage": 0.846
      },
      {
        "id": 11,
        "name": "يوسف خميس ممدوح حسن",
        "sheet": "عبدالرحمن محمد حسن",
        "total": 208,
        "percentage": 0.832
      },
      {
        "id": 12,
        "name": "عبدالرحمن علاء إمام عبدالرحمن",
        "sheet": "عبدالرحمن محمد حسن",
        "total": 206.5,
        "percentage": 0.826
      },
      {
        "id": 13,
        "name": "يوسف علاء جمعة حسين",
        "sheet": "عبدالرحمن محمد حسن",
        "total": 206,
        "percentage": 0.824
      },
      {
        "id": 14,
        "name": "عبدالله محمد سيد يس",
        "sheet": "عبدالرحمن محمد حسن",
        "total": 205,
        "percentage": 0.82
      },
      {
        "id": 15,
        "name": "بدرالدين أيمن عبدالفتاح أحمد",
        "sheet": "عبدالرحمن محمد حسن",
        "total": 201.5,
        "percentage": 0.806
      },
      {
        "id": 16,
        "name": "محمد عماد شعبان محب",
        "sheet": "عبدالرحمن محمد حسن",
        "total": 199.5,
        "percentage": 0.798
      },
      {
        "id": 17,
        "name": "محمد أيمن عبدالفتاح أحمد",
        "sheet": "عبدالرحمن محمد حسن",
        "total": 184,
        "percentage": 0.736
      },
      {
        "id": 18,
        "name": "أحمد عباس أحمد عباس",
        "sheet": "عبدالرحمن محمد حسن",
        "total": 181,
        "percentage": 0.724
      }
    ],
    "grades": {
      "امتياز": 3,
      "جيد جدا": 12,
      "جيد": 3,
      "مقبول": 0,
      "راسب": 0
    },
    "total": 18
  },
  "شروق ياسر يوسف": {
    "name": "شروق ياسر يوسف",
    "students": [
      {
        "id": 7,
        "name": "رحمة أحمد سيد خميس",
        "sheet": "شروق ياسر يوسف",
        "total": 233.25,
        "percentage": 0.933
      },
      {
        "id": 9,
        "name": "ريتاج محمد عزت محمد",
        "sheet": "شروق ياسر يوسف",
        "total": 228.5,
        "percentage": 0.914
      },
      {
        "id": 7,
        "name": "عمر وجيه برباش جابر",
        "sheet": "شروق ياسر يوسف",
        "total": 222,
        "percentage": 0.888
      },
      {
        "id": 9,
        "name": "يوسف حمادة يحيى",
        "sheet": "شروق ياسر يوسف",
        "total": 220.5,
        "percentage": 0.882
      },
      {
        "id": 3,
        "name": "جودي علاء عبدالوهاب عبدالعزيز",
        "sheet": "شروق ياسر يوسف",
        "total": 219.5,
        "percentage": 0.878
      },
      {
        "id": 5,
        "name": "سجدة سعيد أحمد عباس",
        "sheet": "شروق ياسر يوسف",
        "total": 218.25,
        "percentage": 0.873
      },
      {
        "id": 3,
        "name": "أية محمد حسن محمود",
        "sheet": "شروق ياسر يوسف",
        "total": 218,
        "percentage": 0.872
      },
      {
        "id": 16,
        "name": "مريم شريف حسين علي",
        "sheet": "شروق ياسر يوسف",
        "total": 217.5,
        "percentage": 0.87
      },
      {
        "id": 20,
        "name": "محمد علاء محمد قرني",
        "sheet": "شروق ياسر يوسف",
        "total": 217,
        "percentage": 0.868
      },
      {
        "id": 4,
        "name": "رودينا سيد حامد سيد",
        "sheet": "شروق ياسر يوسف",
        "total": 214.75,
        "percentage": 0.859
      },
      {
        "id": 1,
        "name": "أحمد ربيع عبدالحميد محمد",
        "sheet": "شروق ياسر يوسف",
        "total": 214.5,
        "percentage": 0.858
      },
      {
        "id": 6,
        "name": "خالد أحمد محمد محمد",
        "sheet": "شروق ياسر يوسف",
        "total": 213.5,
        "percentage": 0.854
      },
      {
        "id": 8,
        "name": "محمد سيد حامد سيد",
        "sheet": "شروق ياسر يوسف",
        "total": 213.5,
        "percentage": 0.854
      },
      {
        "id": 4,
        "name": "بسمة عماد رياض خلف",
        "sheet": "شروق ياسر يوسف",
        "total": 213,
        "percentage": 0.852
      },
      {
        "id": 5,
        "name": "جنا عماد جابر شحات",
        "sheet": "شروق ياسر يوسف",
        "total": 212.5,
        "percentage": 0.85
      },
      {
        "id": 11,
        "name": "شمس محمد عزت محمد",
        "sheet": "شروق ياسر يوسف",
        "total": 210,
        "percentage": 0.84
      },
      {
        "id": 13,
        "name": "عبدالرحمن أحمد رمضان شعبان",
        "sheet": "شروق ياسر يوسف",
        "total": 210,
        "percentage": 0.84
      },
      {
        "id": 10,
        "name": "زياد عماد جابر شحات",
        "sheet": "شروق ياسر يوسف",
        "total": 209.5,
        "percentage": 0.838
      },
      {
        "id": 19,
        "name": "ملك عصمت مصطفى عبدالعزيز",
        "sheet": "شروق ياسر يوسف",
        "total": 209.25,
        "percentage": 0.837
      },
      {
        "id": 17,
        "name": "مصطفى عصمت مصطفى عبدالعزيز",
        "sheet": "شروق ياسر يوسف",
        "total": 209,
        "percentage": 0.836
      },
      {
        "id": 18,
        "name": "مكة فضل شحاتة حسن",
        "sheet": "شروق ياسر يوسف",
        "total": 209,
        "percentage": 0.836
      },
      {
        "id": 15,
        "name": "محمد وليد عبدالفتاح عبدالحميد",
        "sheet": "شروق ياسر يوسف",
        "total": 208,
        "percentage": 0.832
      },
      {
        "id": 1,
        "name": "إسلام محمد مفتاح أحمد",
        "sheet": "شروق ياسر يوسف",
        "total": 205.25,
        "percentage": 0.821
      },
      {
        "id": 2,
        "name": "أحمد صابر عبدالفتاح إبراهيم",
        "sheet": "شروق ياسر يوسف",
        "total": 205,
        "percentage": 0.82
      },
      {
        "id": 14,
        "name": "محمد سامي سيد كامل",
        "sheet": "شروق ياسر يوسف",
        "total": 205,
        "percentage": 0.82
      },
      {
        "id": 6,
        "name": "عمر مصطفى قرني محمد",
        "sheet": "شروق ياسر يوسف",
        "total": 205,
        "percentage": 0.82
      },
      {
        "id": 2,
        "name": "جنا محمد عبدالتواب عبدالوهاب",
        "sheet": "شروق ياسر يوسف",
        "total": 204,
        "percentage": 0.816
      },
      {
        "id": 12,
        "name": "صفا ربيع قرنى هبار",
        "sheet": "شروق ياسر يوسف",
        "total": 203.5,
        "percentage": 0.814
      },
      {
        "id": 8,
        "name": "روضة أحمد جمعة إسماعيل",
        "sheet": "شروق ياسر يوسف",
        "total": 117.5,
        "percentage": 0.47
      }
    ],
    "grades": {
      "امتياز": 2,
      "جيد جدا": 26,
      "جيد": 0,
      "مقبول": 0,
      "راسب": 1
    },
    "total": 29
  },
  "دينا مصطفى كامل": {
    "name": "دينا مصطفى كامل",
    "students": [
      {
        "id": 1,
        "name": "عدى جمعة فتح الباب محمد",
        "sheet": "دينا مصطفى كامل",
        "total": 232.5,
        "percentage": 0.93
      },
      {
        "id": 2,
        "name": "مريم سيد سعيد احمد",
        "sheet": "دينا مصطفى كامل",
        "total": 231,
        "percentage": 0.924
      },
      {
        "id": 3,
        "name": "خديجة محمود اسماعيل حامد",
        "sheet": "دينا مصطفى كامل",
        "total": 228,
        "percentage": 0.912
      },
      {
        "id": 4,
        "name": "مهران محمد رأفت عبدالحكم",
        "sheet": "دينا مصطفى كامل",
        "total": 227.5,
        "percentage": 0.91
      },
      {
        "id": 5,
        "name": "نادين طه محمد صادق",
        "sheet": "دينا مصطفى كامل",
        "total": 226.5,
        "percentage": 0.906
      },
      {
        "id": 6,
        "name": "حمزة نبيل عويس احمد",
        "sheet": "دينا مصطفى كامل",
        "total": 220.5,
        "percentage": 0.882
      },
      {
        "id": 7,
        "name": "مصطفى عبد النبى شعبان شحاتة",
        "sheet": "دينا مصطفى كامل",
        "total": 220.5,
        "percentage": 0.882
      },
      {
        "id": 8,
        "name": "رودينا ناصر فتحى جودة",
        "sheet": "دينا مصطفى كامل",
        "total": 216,
        "percentage": 0.864
      },
      {
        "id": 9,
        "name": "أحمد أشرف ابراهيم عبدالعزيز",
        "sheet": "دينا مصطفى كامل",
        "total": 215.5,
        "percentage": 0.862
      },
      {
        "id": 10,
        "name": "مروان وجيه فاروق محمد",
        "sheet": "دينا مصطفى كامل",
        "total": 214.5,
        "percentage": 0.858
      },
      {
        "id": 11,
        "name": "ندى اسماعيل عبدالحسيب امام",
        "sheet": "دينا مصطفى كامل",
        "total": 214.5,
        "percentage": 0.858
      },
      {
        "id": 12,
        "name": "ادم محمد صلاح على",
        "sheet": "دينا مصطفى كامل",
        "total": 214,
        "percentage": 0.856
      },
      {
        "id": 13,
        "name": "سيد محمد سيد سلامة",
        "sheet": "دينا مصطفى كامل",
        "total": 214,
        "percentage": 0.856
      },
      {
        "id": 14,
        "name": "اسراء رمضان نصر أحمد",
        "sheet": "دينا مصطفى كامل",
        "total": 211,
        "percentage": 0.844
      },
      {
        "id": 15,
        "name": "عادل طوسون عادل سيد",
        "sheet": "دينا مصطفى كامل",
        "total": 210,
        "percentage": 0.84
      },
      {
        "id": 16,
        "name": "جنا وجيه عباس أحمد",
        "sheet": "دينا مصطفى كامل",
        "total": 209.75,
        "percentage": 0.839
      },
      {
        "id": 17,
        "name": "عمار محمد سلامة سيد",
        "sheet": "دينا مصطفى كامل",
        "total": 209,
        "percentage": 0.836
      },
      {
        "id": 18,
        "name": "محمد عصمت مصطفى عبدالعزيز",
        "sheet": "دينا مصطفى كامل",
        "total": 208.5,
        "percentage": 0.834
      },
      {
        "id": 19,
        "name": "يوسف محمد حمدى سيد",
        "sheet": "دينا مصطفى كامل",
        "total": 202,
        "percentage": 0.808
      }
    ],
    "grades": {
      "امتياز": 5,
      "جيد جدا": 14,
      "جيد": 0,
      "مقبول": 0,
      "راسب": 0
    },
    "total": 19
  },
  "إيمان حمادة شحاتة": {
    "name": "إيمان حمادة شحاتة",
    "students": [
      {
        "id": 1,
        "name": "أنس حسين عبدالواحد محمد",
        "sheet": "إيمان حمادة شحاتة",
        "total": 232,
        "percentage": 0.928
      },
      {
        "id": 2,
        "name": "سجدة أحمد عطية محمد",
        "sheet": "إيمان حمادة شحاتة",
        "total": 226.5,
        "percentage": 0.906
      },
      {
        "id": 3,
        "name": "سجدة مصطفى سيد عبدالعظيم",
        "sheet": "إيمان حمادة شحاتة",
        "total": 225.5,
        "percentage": 0.902
      },
      {
        "id": 4,
        "name": "تقوى سيد رجب عبدالرحمن",
        "sheet": "إيمان حمادة شحاتة",
        "total": 221,
        "percentage": 0.884
      },
      {
        "id": 5,
        "name": "يامن سامح سيد عبدالتواب",
        "sheet": "إيمان حمادة شحاتة",
        "total": 221,
        "percentage": 0.884
      },
      {
        "id": 6,
        "name": "إيسل أحمد جابر شاكر",
        "sheet": "إيمان حمادة شحاتة",
        "total": 218,
        "percentage": 0.872
      },
      {
        "id": 7,
        "name": "أنس شعبان علي جنيدي",
        "sheet": "إيمان حمادة شحاتة",
        "total": 218,
        "percentage": 0.872
      },
      {
        "id": 8,
        "name": "أحمد حسين فضالي عويس",
        "sheet": "إيمان حمادة شحاتة",
        "total": 214.5,
        "percentage": 0.858
      },
      {
        "id": 9,
        "name": "رضوى رمضان رجب عبدالحميد",
        "sheet": "إيمان حمادة شحاتة",
        "total": 214,
        "percentage": 0.856
      },
      {
        "id": 10,
        "name": "محمد ربيع علي قرني",
        "sheet": "إيمان حمادة شحاتة",
        "total": 214,
        "percentage": 0.856
      },
      {
        "id": 11,
        "name": "مصطفى محمود مصطفى حسين",
        "sheet": "إيمان حمادة شحاتة",
        "total": 214,
        "percentage": 0.856
      },
      {
        "id": 12,
        "name": "رقية محمود فتحي أمين",
        "sheet": "إيمان حمادة شحاتة",
        "total": 212,
        "percentage": 0.848
      },
      {
        "id": 13,
        "name": "حور أحمد جمال علي",
        "sheet": "إيمان حمادة شحاتة",
        "total": 211.5,
        "percentage": 0.846
      },
      {
        "id": 14,
        "name": "عثمان مصطفي عثمان مصطفي",
        "sheet": "إيمان حمادة شحاتة",
        "total": 211.5,
        "percentage": 0.846
      },
      {
        "id": 15,
        "name": "ياسر محمد سلامة سيد",
        "sheet": "إيمان حمادة شحاتة",
        "total": 198,
        "percentage": 0.792
      },
      {
        "id": 16,
        "name": "عباس وجيه عباس أحمد",
        "sheet": "إيمان حمادة شحاتة",
        "total": 195,
        "percentage": 0.78
      },
      {
        "id": 17,
        "name": "بسنت عماد رياض خلف",
        "sheet": "إيمان حمادة شحاتة",
        "total": 189,
        "percentage": 0.756
      }
    ],
    "grades": {
      "امتياز": 3,
      "جيد جدا": 11,
      "جيد": 3,
      "مقبول": 0,
      "راسب": 0
    },
    "total": 17
  },
  "آية شريف عبدالعظيم رمزي": {
    "name": "آية شريف عبدالعظيم رمزي",
    "students": [
      {
        "id": 1,
        "name": "مروه محمد رجب كامل",
        "sheet": "آية شريف عبدالعظيم رمزي",
        "total": 231.5,
        "percentage": 0.926
      },
      {
        "id": 2,
        "name": "جنى محمد خميس عبد العظيم",
        "sheet": "آية شريف عبدالعظيم رمزي",
        "total": 231,
        "percentage": 0.924
      },
      {
        "id": 3,
        "name": "عمار حسين فضالى عويس",
        "sheet": "آية شريف عبدالعظيم رمزي",
        "total": 230.25,
        "percentage": 0.921
      },
      {
        "id": 4,
        "name": "حمزه محمود عبد الحليم محمد",
        "sheet": "آية شريف عبدالعظيم رمزي",
        "total": 223,
        "percentage": 0.892
      },
      {
        "id": 5,
        "name": "عمر أحمد تهامى على",
        "sheet": "آية شريف عبدالعظيم رمزي",
        "total": 223,
        "percentage": 0.892
      },
      {
        "id": 6,
        "name": "رودينا محمد شعبان عبد الوهاب",
        "sheet": "آية شريف عبدالعظيم رمزي",
        "total": 220.5,
        "percentage": 0.882
      },
      {
        "id": 7,
        "name": "على محمود على عبد العزيز",
        "sheet": "آية شريف عبدالعظيم رمزي",
        "total": 220.5,
        "percentage": 0.882
      },
      {
        "id": 8,
        "name": "حنين محمود على عبد العزيز",
        "sheet": "آية شريف عبدالعظيم رمزي",
        "total": 220,
        "percentage": 0.88
      },
      {
        "id": 9,
        "name": "رودينا شامل مصطفى السيد",
        "sheet": "آية شريف عبدالعظيم رمزي",
        "total": 219.5,
        "percentage": 0.878
      },
      {
        "id": 10,
        "name": "عمر أحمد سيد حفنى",
        "sheet": "آية شريف عبدالعظيم رمزي",
        "total": 218.5,
        "percentage": 0.874
      },
      {
        "id": 11,
        "name": "محمد محمود أحمد سعيد",
        "sheet": "آية شريف عبدالعظيم رمزي",
        "total": 218.5,
        "percentage": 0.874
      },
      {
        "id": 12,
        "name": "مالك محمود عبد الحليم محمد",
        "sheet": "آية شريف عبدالعظيم رمزي",
        "total": 212.5,
        "percentage": 0.85
      },
      {
        "id": 13,
        "name": "محمد عثمان أحمد عثمان",
        "sheet": "آية شريف عبدالعظيم رمزي",
        "total": 203.5,
        "percentage": 0.814
      }
    ],
    "grades": {
      "امتياز": 3,
      "جيد جدا": 10,
      "جيد": 0,
      "مقبول": 0,
      "راسب": 0
    },
    "total": 13
  },
  "شاهندة حمادة عبدالفتاح": {
    "name": "شاهندة حمادة عبدالفتاح",
    "students": [
      {
        "id": 1,
        "name": "عائشة محمود سيد حسين",
        "sheet": "شاهندة حمادة عبدالفتاح",
        "total": 229,
        "percentage": 0.916
      },
      {
        "id": 2,
        "name": "حمزة أحمد سعد محمد",
        "sheet": "شاهندة حمادة عبدالفتاح",
        "total": 227.5,
        "percentage": 0.91
      },
      {
        "id": 3,
        "name": "سليم صبرى جابر علاء الدين",
        "sheet": "شاهندة حمادة عبدالفتاح",
        "total": 226,
        "percentage": 0.904
      },
      {
        "id": 4,
        "name": "مكة محمود عيد متولي",
        "sheet": "شاهندة حمادة عبدالفتاح",
        "total": 225,
        "percentage": 0.9
      },
      {
        "id": 5,
        "name": "فريدة محمود إسماعيل سيد",
        "sheet": "شاهندة حمادة عبدالفتاح",
        "total": 224,
        "percentage": 0.896
      },
      {
        "id": 6,
        "name": "بتول أحمد سعد محمد",
        "sheet": "شاهندة حمادة عبدالفتاح",
        "total": 223,
        "percentage": 0.892
      },
      {
        "id": 7,
        "name": "مكة أشرف سليمان عبدالمنعم",
        "sheet": "شاهندة حمادة عبدالفتاح",
        "total": 223,
        "percentage": 0.892
      },
      {
        "id": 8,
        "name": "لوجي عصام عبدالحميد عمر",
        "sheet": "شاهندة حمادة عبدالفتاح",
        "total": 222,
        "percentage": 0.888
      },
      {
        "id": 9,
        "name": "إيلين أكرم إسماعيل سيد",
        "sheet": "شاهندة حمادة عبدالفتاح",
        "total": 221,
        "percentage": 0.884
      },
      {
        "id": 10,
        "name": "أنس أحمد شعبان فتحي",
        "sheet": "شاهندة حمادة عبدالفتاح",
        "total": 221,
        "percentage": 0.884
      },
      {
        "id": 11,
        "name": "صفا محمد حسين سلامه",
        "sheet": "شاهندة حمادة عبدالفتاح",
        "total": 220,
        "percentage": 0.88
      },
      {
        "id": 12,
        "name": "مالك محمود محمد إبراهيم",
        "sheet": "شاهندة حمادة عبدالفتاح",
        "total": 220,
        "percentage": 0.88
      },
      {
        "id": 13,
        "name": "مريم شعبان عمر عبدالمنعم",
        "sheet": "شاهندة حمادة عبدالفتاح",
        "total": 219,
        "percentage": 0.876
      },
      {
        "id": 14,
        "name": "سهيلة منصور سيد خليفة",
        "sheet": "شاهندة حمادة عبدالفتاح",
        "total": 218,
        "percentage": 0.872
      },
      {
        "id": 15,
        "name": "علي عيد جبر تمام",
        "sheet": "شاهندة حمادة عبدالفتاح",
        "total": 218,
        "percentage": 0.872
      },
      {
        "id": 16,
        "name": "مكة مصطفى حسن علي",
        "sheet": "شاهندة حمادة عبدالفتاح",
        "total": 215,
        "percentage": 0.86
      },
      {
        "id": 17,
        "name": "سيد أحمد بيومي أحمد",
        "sheet": "شاهندة حمادة عبدالفتاح",
        "total": 213,
        "percentage": 0.852
      },
      {
        "id": 21,
        "name": "زينة أيمن محمد عبدالمنعم",
        "sheet": "شاهندة حمادة عبدالفتاح",
        "total": 213,
        "percentage": 0.852
      },
      {
        "id": 18,
        "name": "جودى حامد ربيع حسين",
        "sheet": "شاهندة حمادة عبدالفتاح",
        "total": 212,
        "percentage": 0.848
      },
      {
        "id": 19,
        "name": "محمد شعبان علي جنيدي",
        "sheet": "شاهندة حمادة عبدالفتاح",
        "total": 207,
        "percentage": 0.828
      },
      {
        "id": 20,
        "name": "حمزة عبدالحليم محمد إبراهيم",
        "sheet": "شاهندة حمادة عبدالفتاح",
        "total": 200,
        "percentage": 0.8
      },
      {
        "id": 22,
        "name": "محمود أحمد عبدالعزيز روبي",
        "sheet": "شاهندة حمادة عبدالفتاح",
        "total": 129,
        "percentage": 0.516
      }
    ],
    "grades": {
      "امتياز": 4,
      "جيد جدا": 17,
      "جيد": 0,
      "مقبول": 1,
      "راسب": 0
    },
    "total": 22
  },
  "منى علاء جمعة": {
    "name": "منى علاء جمعة",
    "students": [
      {
        "id": 1,
        "name": "ياسين إسماعيل حجاج إسماعيل",
        "sheet": "منى علاء جمعة",
        "total": 228,
        "percentage": 0.912
      },
      {
        "id": 2,
        "name": "ياسين أحمد رجب عويس",
        "sheet": "منى علاء جمعة",
        "total": 227,
        "percentage": 0.908
      },
      {
        "id": 3,
        "name": "أنس محمد عبدالفتاح جابر",
        "sheet": "منى علاء جمعة",
        "total": 226,
        "percentage": 0.904
      },
      {
        "id": 4,
        "name": "رودينا محمود فتحي أمين",
        "sheet": "منى علاء جمعة",
        "total": 222,
        "percentage": 0.888
      },
      {
        "id": 5,
        "name": "فريدة محمود حمدي طه",
        "sheet": "منى علاء جمعة",
        "total": 222,
        "percentage": 0.888
      },
      {
        "id": 6,
        "name": "لوجي أحمد فتحي عبدالسلام",
        "sheet": "منى علاء جمعة",
        "total": 222,
        "percentage": 0.888
      },
      {
        "id": 7,
        "name": "معتز هاني عبدالحميد خالد",
        "sheet": "منى علاء جمعة",
        "total": 222,
        "percentage": 0.888
      },
      {
        "id": 8,
        "name": "ياسين أحمد عويس أحمد",
        "sheet": "منى علاء جمعة",
        "total": 222,
        "percentage": 0.888
      },
      {
        "id": 9,
        "name": "تالين أحمد عباس قرني",
        "sheet": "منى علاء جمعة",
        "total": 219,
        "percentage": 0.876
      },
      {
        "id": 10,
        "name": "عمر محمد غانم محمد",
        "sheet": "منى علاء جمعة",
        "total": 218,
        "percentage": 0.872
      },
      {
        "id": 11,
        "name": "ثابت علاء ثابت كمال",
        "sheet": "منى علاء جمعة",
        "total": 213,
        "percentage": 0.852
      },
      {
        "id": 12,
        "name": "حفصة رجب خميس عبدالجواد",
        "sheet": "منى علاء جمعة",
        "total": 213,
        "percentage": 0.852
      },
      {
        "id": 13,
        "name": "ساندي حجازي سيد رزق",
        "sheet": "منى علاء جمعة",
        "total": 212,
        "percentage": 0.848
      },
      {
        "id": 14,
        "name": "كارما أشرف خميس عبدالجواد",
        "sheet": "منى علاء جمعة",
        "total": 208,
        "percentage": 0.832
      },
      {
        "id": 15,
        "name": "ساندي عصام ممدوح عبداللطيف",
        "sheet": "منى علاء جمعة",
        "total": 207,
        "percentage": 0.828
      },
      {
        "id": 16,
        "name": "عمار سيد حافظ سيد",
        "sheet": "منى علاء جمعة",
        "total": 203,
        "percentage": 0.812
      },
      {
        "id": 17,
        "name": "أمنية محمد حمدي سيد",
        "sheet": "منى علاء جمعة",
        "total": 202,
        "percentage": 0.808
      },
      {
        "id": 18,
        "name": "عبد الرحمن محمود رضوان",
        "sheet": "منى علاء جمعة",
        "total": 202,
        "percentage": 0.808
      },
      {
        "id": 19,
        "name": "إياد وجيه جمال جابر",
        "sheet": "منى علاء جمعة",
        "total": 198,
        "percentage": 0.792
      }
    ],
    "grades": {
      "امتياز": 3,
      "جيد جدا": 15,
      "جيد": 1,
      "مقبول": 0,
      "راسب": 0
    },
    "total": 19
  },
  "رقية نصار عبدالمعتمد": {
    "name": "رقية نصار عبدالمعتمد",
    "students": [
      {
        "id": 1,
        "name": "ملك حسني أحمد حامد",
        "sheet": "رقية نصار عبدالمعتمد",
        "total": 227.25,
        "percentage": 0.909
      },
      {
        "id": 2,
        "name": "رويدا وليد سيد خالد",
        "sheet": "رقية نصار عبدالمعتمد",
        "total": 220.75,
        "percentage": 0.883
      },
      {
        "id": 3,
        "name": "آية حمادة شحاتة عبدالجواد",
        "sheet": "رقية نصار عبدالمعتمد",
        "total": 220.25,
        "percentage": 0.881
      },
      {
        "id": 4,
        "name": "حنين مصطفى محمد محمود",
        "sheet": "رقية نصار عبدالمعتمد",
        "total": 219,
        "percentage": 0.876
      },
      {
        "id": 5,
        "name": "روان محمد رجب كامل",
        "sheet": "رقية نصار عبدالمعتمد",
        "total": 217,
        "percentage": 0.868
      },
      {
        "id": 6,
        "name": "محمد محمود رضوان عبدالحميد",
        "sheet": "رقية نصار عبدالمعتمد",
        "total": 216,
        "percentage": 0.864
      },
      {
        "id": 7,
        "name": "روان عصام عبد الحميد صابر",
        "sheet": "رقية نصار عبدالمعتمد",
        "total": 215.5,
        "percentage": 0.862
      },
      {
        "id": 8,
        "name": "سما نبيل فتحي عبدالسلام",
        "sheet": "رقية نصار عبدالمعتمد",
        "total": 214.75,
        "percentage": 0.859
      },
      {
        "id": 9,
        "name": "آية محمد فتحي عبدالسلام",
        "sheet": "رقية نصار عبدالمعتمد",
        "total": 214,
        "percentage": 0.856
      },
      {
        "id": 10,
        "name": "جنا محمود فتحى أمين",
        "sheet": "رقية نصار عبدالمعتمد",
        "total": 211,
        "percentage": 0.844
      },
      {
        "id": 11,
        "name": "محمد محمود عبدالحليم محمد",
        "sheet": "رقية نصار عبدالمعتمد",
        "total": 207.5,
        "percentage": 0.83
      },
      {
        "id": 12,
        "name": "ياسمين محمود شعبان محب",
        "sheet": "رقية نصار عبدالمعتمد",
        "total": 205,
        "percentage": 0.82
      },
      {
        "id": 13,
        "name": "روضة ربيع قرني هبار",
        "sheet": "رقية نصار عبدالمعتمد",
        "total": 194.5,
        "percentage": 0.778
      }
    ],
    "grades": {
      "امتياز": 1,
      "جيد جدا": 11,
      "جيد": 1,
      "مقبول": 0,
      "راسب": 0
    },
    "total": 13
  },
  "نادية سيد سلامة": {
    "name": "نادية سيد سلامة",
    "students": [
      {
        "id": 4,
        "name": "سارة محمد سيد ياسين",
        "sheet": "نادية سيد سلامة",
        "total": 227,
        "percentage": 0.908
      },
      {
        "id": 2,
        "name": "بسملة محمد فتحي عبدالسلام",
        "sheet": "نادية سيد سلامة",
        "total": 215.5,
        "percentage": 0.862
      },
      {
        "id": 5,
        "name": "سومية حنفي محمود جودة",
        "sheet": "نادية سيد سلامة",
        "total": 118.5,
        "percentage": 0.474
      },
      {
        "id": 6,
        "name": "منة ربيع عصمت محمد",
        "sheet": "نادية سيد سلامة",
        "total": 117.5,
        "percentage": 0.47
      },
      {
        "id": 7,
        "name": "وفاء طه حلمى عبد الوهاب",
        "sheet": "نادية سيد سلامة",
        "total": 116.5,
        "percentage": 0.466
      },
      {
        "id": 3,
        "name": "دينا أحمد قرني محمد",
        "sheet": "نادية سيد سلامة",
        "total": 91,
        "percentage": 0.364
      },
      {
        "id": 1,
        "name": "إيمان أحمد عرفات سيد",
        "sheet": "نادية سيد سلامة",
        "total": 20,
        "percentage": 0.08
      }
    ],
    "grades": {
      "امتياز": 1,
      "جيد جدا": 1,
      "جيد": 0,
      "مقبول": 0,
      "راسب": 5
    },
    "total": 7
  },
  "منة محمد عبدالعظيم": {
    "name": "منة محمد عبدالعظيم",
    "students": [
      {
        "id": 1,
        "name": "رحمة عبدالرحمن عواد إبراهيم",
        "sheet": "منة محمد عبدالعظيم",
        "total": 227,
        "percentage": 0.908
      },
      {
        "id": 2,
        "name": "رودينا ربيع عطية عوض",
        "sheet": "منة محمد عبدالعظيم",
        "total": 226,
        "percentage": 0.904
      },
      {
        "id": 3,
        "name": "أنس محمد شوقي عبدالجواد",
        "sheet": "منة محمد عبدالعظيم",
        "total": 224,
        "percentage": 0.896
      },
      {
        "id": 4,
        "name": "نهى محمد طه محمد",
        "sheet": "منة محمد عبدالعظيم",
        "total": 222,
        "percentage": 0.888
      },
      {
        "id": 5,
        "name": "مكة وجية فتحي مغازي",
        "sheet": "منة محمد عبدالعظيم",
        "total": 221,
        "percentage": 0.884
      },
      {
        "id": 6,
        "name": "هنا محمد عباس أحمد",
        "sheet": "منة محمد عبدالعظيم",
        "total": 221,
        "percentage": 0.884
      },
      {
        "id": 7,
        "name": "مروان حسين ربيع حسين",
        "sheet": "منة محمد عبدالعظيم",
        "total": 220,
        "percentage": 0.88
      },
      {
        "id": 8,
        "name": "أحمد محمد فتحي عبدالتواب",
        "sheet": "منة محمد عبدالعظيم",
        "total": 219.5,
        "percentage": 0.878
      },
      {
        "id": 9,
        "name": "محمد كامل رجب كامل",
        "sheet": "منة محمد عبدالعظيم",
        "total": 219,
        "percentage": 0.876
      },
      {
        "id": 10,
        "name": "اسمة سلامة عيد حمزة",
        "sheet": "منة محمد عبدالعظيم",
        "total": 218,
        "percentage": 0.872
      },
      {
        "id": 11,
        "name": "أحمد محمد جابر خلف",
        "sheet": "منة محمد عبدالعظيم",
        "total": 218,
        "percentage": 0.872
      },
      {
        "id": 12,
        "name": "تبارك نادي أحمد حامد",
        "sheet": "منة محمد عبدالعظيم",
        "total": 216,
        "percentage": 0.864
      },
      {
        "id": 13,
        "name": "بلال شعبان سيد خلف",
        "sheet": "منة محمد عبدالعظيم",
        "total": 215,
        "percentage": 0.86
      },
      {
        "id": 14,
        "name": "فريدة أشرف محمد سيد",
        "sheet": "منة محمد عبدالعظيم",
        "total": 213,
        "percentage": 0.852
      },
      {
        "id": 15,
        "name": "محمد ياسر محمد أحمد",
        "sheet": "منة محمد عبدالعظيم",
        "total": 211,
        "percentage": 0.844
      },
      {
        "id": 16,
        "name": "مليكة أنور سيد أنور",
        "sheet": "منة محمد عبدالعظيم",
        "total": 211,
        "percentage": 0.844
      },
      {
        "id": 17,
        "name": "سجدة رمضان عيد محمد",
        "sheet": "منة محمد عبدالعظيم",
        "total": 210,
        "percentage": 0.84
      },
      {
        "id": 18,
        "name": "محمد شريف حسين علي",
        "sheet": "منة محمد عبدالعظيم",
        "total": 208,
        "percentage": 0.832
      },
      {
        "id": 19,
        "name": "رؤى ياسر محمد أحمد",
        "sheet": "منة محمد عبدالعظيم",
        "total": 206,
        "percentage": 0.824
      },
      {
        "id": 20,
        "name": "عمر فضل شحاتة حسن",
        "sheet": "منة محمد عبدالعظيم",
        "total": 203,
        "percentage": 0.812
      },
      {
        "id": 21,
        "name": "روان ربيع عطية عوض",
        "sheet": "منة محمد عبدالعظيم",
        "total": 199,
        "percentage": 0.796
      },
      {
        "id": 22,
        "name": "أثينات محمد أحمد عباس",
        "sheet": "منة محمد عبدالعظيم",
        "total": 188,
        "percentage": 0.752
      }
    ],
    "grades": {
      "امتياز": 2,
      "جيد جدا": 18,
      "جيد": 2,
      "مقبول": 0,
      "راسب": 0
    },
    "total": 22
  }
};

export const teachers = Object.keys(teacherData);
